[
    {
        "buildNumber": 12606,
        "versionString": "Sprint 38",
        "dateString": "14.04.2014",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-38",
        "downloadURL": "http://brackets.io",
        "newFeatures": [
            {
                "name": "Mehrere Cursors und Auswahlen",
                "description": "Erstellen Sie mehrere Cursors, unterbrochene Auswahlen und rechteckige Auswahlen, um ähnliche Änderungen an mehreren Stellen gleichzeitig durchzuführen."
            },
            {
                "name": "Treffer zur Auswahl hinzufügen",
                "description": "Fügen Sie das nächste Vorkommen des aktuellen Worts bzw. der aktuellen Auswahl schnell zur Mehrfachauswahl hinzu, indem Sie ⌘B/Strg+B drücken. Sie können mit ⌘⌃G/Alt+F3 auch alle Vorkommen auswählen. Das ist für schnelles Umbenennen nützlich."
            },
            {
                "name": "Auswahl rückgängig machen",
                "description": "Machen Sie die letzte Änderung der Auswahl mit ⌘U/Strg+U rückgängig, und wiederholen Sie die Auswahl mit ⌘⇧U/Strg+Umschalt+U. Das ist nützlich, wenn Sie ein Missgeschick bei einer Mehrfachauswahl korrigieren oder zur Position der letzten Auswahl zurückkehren wollen."
            },  
            {
                "name": "Alle Unterordner einklappen",
                "description":  "Nutzen Sie ⌘⌥Klick/Strg+Alt+Klick, um alle Unterordner eines Ordners im Dateibaum einzuklappen."
            },
            {
                "name": "Erweitertes Feedback beim Schnellen Bearbeiten",
                "description": "Schnelles Bearbeiten (⌘E/Strg+E) und die Schnell-Dokumentation (⌘K/Strg+K) zeigen Ihnen nun helfende Informationen an, wenn sie von Codestellen aus aufgerufen werden, die diese Befehle nicht unterstützen."
            },            
            {
                "name": "Unterstützung von .ico-Dateien in der Bildvorschau",
                "description": "Sie können nun .ico-Dateien im Dateibaum auswählen, um sie anzuzeigen."
            },
            {
                "name": "API für asynchrones Linten",
                "description": "Linter können von nun an asynchron agieren, was die Reaktionsfähigkeit und Performance steigert."
            }
        ]
    },  
    {
        "buildNumber": 12014,
        "versionString": "Sprint 37",
        "dateString": "17.03.2014",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-37",
        "downloadURL": "http://brackets.io",
        "newFeatures": [
            {
                "name": "Dateien/Ordner von der Suche im Projekt ausschließen",
                "description": "Legen Sie Datei- und Ordnernamen oder Platzhalter fest, die bei der Suche in mehreren Dateien ausgeschlossen werden."
            },
            {
                "name": "Verifizierter Installer auf dem Mac und unter Windows",
                "description": "Brackets-Versionen sind nun auf dem Mac und unter Windows verifiziert, wodurch die Installtion und Updates einfacher gemacht werden."
            },
            {
                "name": "Verbesserungen der Einstellungs-Infrastruktur",
                "description": "Die neue Einstellungs-API ist nun soweit, dass sie von Erweiterungen genutzt werden kann. Außerdem wurden neue Einstellungen hinzugefügt: siehe http://is.gd/BracketsPrefs für eine Übersicht."
            },
            {
                "name": "Installation von Erweiterungen durch Proxys",
                "description": "Mithilfe der \"proxy\"-Einstellung können Erweiterungen durch einen Proxyserver hindurch installiert werden. Siehe http://is.gd/BracketsPrefs für mehr Informationen."
            },
            {
                "name": "Verbessertes Schnelles Bearbeiten von Inline-Timing-Funktionen",
                "description": "Ein Editor zum Schnellen Bearbeiten kann nun auch von einer unvollständigen Timing-Funktion (wie \"cubic-bezier()\") ausgehen, um von Null an zu beginnen."
            },
            {
                "name": "Überschreibmodus im UI",
                "description": "Der Cursor verändert sich, während der Überschreibmodus aktiv ist, und es kann in der Statusleiste zwischen Einfüge- und Überschreibmodus umgeschalten werden."
            },
            {
                "name": "Dateisystem, Stabilität der Live-Vorschau und Performance optimiert",
                "description": "Kritische Probleme beim Erkennen von externen Änderungen und beim Starten der Live-Vorschau behoben."
            },
            {
                "name": "Indonesische Übersetzung",
                "description": "Eine indonesische Übersetzung wurde erstellt."
            }
        ]
    },
    {
        "buildNumber": 11506,
        "versionString": "Sprint 36",
        "dateString": "07.02.2014",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-36",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Optimierte Einstellungen",
                "description": "Nutzen Sie JSON-Konfigurationsdateien, um Einstellungen für einen bestimmten Ordner oder Dateityp festzulegen."
            },
            {
                "name": "Verbesserter LESS-Support",
                "description": "CSS-Code-Vervollständigung und Schnell-Dokumentation sind nun auch beim Bearbeiten von LESS-Dateien verfügbar."
            },
            {
                "name": "Dateisystem & Performance",
                "description": "Der Editor und der Dateibaum werden von nun an bei externen Änderungen automatisch aktualisiert. Vorgänge wie \"Im Projekt suchen\" sind deutlich schneller."
            },
            {
                "name": "Erweiterungen",
                "description": "Neuer Befehl Debug > Ohne Erweiterungen neu laden, um bei der Fehlersuche zu helfen. Beim Aktualisieren und Entfernen von Erweiterungen wird Brackets automatisch neu geladen, sodass es nicht mehr geschlossen und erneut geöffnet werden muss."
            },
            {
                "name": "Schnelles Editieren von Animations-Timing",
                "description": "Wenn der Cursor in einer CSS-Timing-Funktion steps() ist, kann das Schnelle Bearbeiten (Strg+E/⌘E) genutzt werden, um die Parameter visuell zu bearbeiten."
            },
            {
                "name": "Windows UI-Updates",
                "description": "Viele Fehler im Windows UI wurden behoben."
            },
            {
                "name": "Linten",
                "description": "Mehrere Erweiterungen können Linter für die selbe Sprache registrieren, wobei alle Resultate gemeinsam im Lint-Panel angezeigt werden."
            },
            {
                "name": "Unterstützung für neue Sprachen",
                "description": "Griechische und koreanische Übersetzungen wurden hinzugefügt."
            }
        ]
    },
    {
        "buildNumber": 10897,
        "versionString": "Sprint 35",
        "dateString": "17.12.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-35",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Neues Find/Replace UI",
                "description": " Das \"Ersetzen\" Feature verwendet nun eine schlanke und aufgeräumte Oberfläche. Diese unterstützt die gleichen Funktionen wie \"Suchen\", einschließlich inkrementeller Suche und Hervorhebung. Neue Schaltflächen für Groß- und Kleinschreibung, Reguläre Ausdrücke und  für den vereinfachten Zugang in \"Suche\", \"Suche in Dateien\" und \"Ersetzen\" sind nun verfügbar."
            },
            {
                "name": "Starten der Live-Vorschau auf dem Mac",
                "description": "Auf dem Mac braucht Chrome beim Start der Live-Vorschau nicht neu gestartet werden."
            },
            {
                "name": "Schnellerer Start",
                "description": "Brackets lädt jetzt bis zu 50% schneller durch minimiertes JavaScript und vorkompiliertes LESS."
            }
        ]
    },
    {
        "buildNumber": 10733,
        "versionString": "(Hotfix) Sprint 34.1",
        "dateString": "03.12.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-34.1",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Bugfix, um das Einfrieren von Brackets beim Öffnen einiger JavaScript Dateien zu verhindern",
                "description": "Bugfix für #6067: Das Öffnen einiger JavaScript-Dateien führte zum Einfrieren von Brackets."
            },
            {
                "name": "Bugfix für UI-Probleme mit einigen LESS-Dateien",
                "description": "Bugfix für #6057: Das Öffnen einiger LESS-Dateien führte dazu, dass das UI des Editors teilweise leer oder mit anderen Fehlern gezeichnet wurde."
            }
        ]
    },
    {
        "buildNumber": 10729,
        "versionString": "Sprint 34",
        "dateString": "15.11.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-34",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Aktualisieren alter Brackets-Installationen",
                "description": "Zukünftige Brackets-Versionen, beginnend mit Sprint 35, werden die bestehende Installation überschreiben. Hinweis: Nur Sprint 34 und spätere werden ersetzt werden. Installationen bis einschließlich Sprint 33 werden nicht verändert und können weiterhin neben allen anderen Versionen installiert sein."
            },
            {
                "name": "UI-Verbesserungen",
                "description": "Die Mac-Version hat jetzt eine dunkle Titelleiste, die zum restlichen Brackets-Design passt."
            },
            {
                "name": "Verbesserung der JavaScript-Code-Hinweise",
                "description": "In frühren Versionen schlug das Anzeigen von Code-Hinweisen bei Dateigrößen von ca. 500-2000 Zeilen sowie in einigen anderen Fällen fehl. Diese Probleme wurden beseitigt."
            },
            {
                "name": "Neue und aktualisierte Übersetzungen",
                "description": "Von der Community wurden niederländische, persische und rumänische Lokalisierungen hinzugefügt, außerdem wurden Französisch, Japanisch, Brasilianisch-Portugiesisch, Tschechisch, Finnisch, Deutsch und Spanisch aktualisiert."
            },
            {
                "name": "Verbesserte Dateisystem-API",
                "description": "Erweiterungsentwicklern steht eine robustere und effizientere Dateisystem-API zur Verfügung. Alle wichtigen Details befinden sich in den Versionshinweisen."
            }
        ]
    },
    {
        "buildNumber": 10188,
        "versionString": "Sprint 33",
        "dateString": "29.10.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-33",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Vorschau von Bildern",
                "description": "Durch das Auswählen eines Bildes im Dateibaum wird eine Vorschau des Bildes angezeigt."
            },
            {
                "name": "Neue CSS-Regel im schnellen Inline-Editor erstellen",
                "description": "Nutzen Sie den \"Neue Regel\"-Button im schnellen CSS-Inline-Editor (Strg+E/⌘E), um eine Regel für das aktuell ausgewählte Element bzw. die Klasse/ID zu erstellen, auch wenn es bisher keine Regeln dafür gibt. Sie können den Selektor danach ändern."
            },
            {
                "name": "Schnelles Bearbeiten für Animations-Easing",
                "description": "Wenn der Cursor in einer CSS-Animations-Timing-Funktion ist, kann ein schneller Inline-Editor (Ctrl+E/⌘E) genutzt werden, um die Timing-Kurve visuell zu bearbeiten."
            },
            {
                "name": "Ersetzen von regulären Ausdrücken",
                "description": "Wenn Sie einen regulären Ausdruck beim Ersetzen nutzen, können Sie $1, $2 usw. im \"Ersetzen mit\"-Text nutzen, um dort die geklammerten Teilausdrücke im regulären Ausdruck zu übernehmen."
            },
            {
                "name": "UI-Verbesserungen",
                "description": "Schnelle Inline-Editoren haben nun einen Button zum Schließen. \"Im Projekt suchen\" meldet Ihnen, wenn nichts gefunden wurde."
            },
            {
                "name": "Aktualisierte Übersetzungen",
                "description": "Französische, japanische, deutsche und tschechische Übersetzungen wurden aktualisiert."
            }
        ]
    },
    {
        "buildNumber": 9791,
        "versionString": "Sprint 32",
        "dateString": "04.10.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-32",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Live-Vorschau für andere Dateitypen als HTML",
                "description": "Brackets findet automatisch die nächstliegende index.html-Datei um die Live-Vorschau zu starten. Damit ist es nicht mehr notwendig, von einer CSS- oder JavaScript-Datei zu einer HTML-Datei zu wechseln, um die Live-Vorschau zu starten."
            },
            {
                "name": "Bessere Performance der dynamischen Suche (engl. Find-as-you-type)",
                "description": "Verbesserung der Antwortzeit während der ersten Text-Eingaben."
            },
            {
                "name": "Node Aktualisierung auf 0.10",
                "description": "Änderung unter der Haube."
            },
            {
                "name": "Verbesserung der Linting API",
                "description": "Erweiterungen können die Linting-Engine im Headless-Modus, d.h. ohne UI, benutzen."
            },
            {
                "name": "Aktualisierte Übersetzungen",
                "description": "Folgende Übersetzungen wurden aktualisiert: Französisch, Japanisch, Deutsch, Tschechisch, brasilianisches Portugiesisch, Schwedisch und Türkisch."
            }
        ]
    },
    {
        "buildNumber": 9569,
        "versionString": "Sprint 31",
        "dateString": "20.09.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-31",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Live-HTML-Bearbeitung",
                "description": "Während der Live-Vorschau werden Änderungen an HTML-Dateien sofort im Browser angezeigt."
            },
            {
                "name": "Windows-Benutzeroberfläche",
                "description": "Windows verwendet jetzt eine dunkle Titelleiste. Dies wird bald ebenfalls auf dem Mac geändert."
            },
            {
                "name": "Tastenkürzel für zuletzt verwendete Projekte",
                "description": "Drücken Sie Ctrl+Alt+R (⌥⌘R) um das Dropdown-Menü zuletzt verwendeter Projekte zu öffnen. Verwenden Sie die Pfeil-Tasten und Enter, um ein Projekt auszuwählen."
            },
            {
                "name": "CSS-Hinweise in SCSS",
                "description": "Code-Hinweise für CSS-Eigenschaftsnamen und -werte: In SCSS-Dateien und Schnell-Dokumentation sind jetzt die gleichen Hinweise wie in CSS Dateien verfügbar."
            },
            {
                "name": "Hervorhebung korrespondierender HTML-Tags",
                "description": "Hervorhebung korrespondierender öffnender und schließender HTML-Tags."
            },
            {
                "name": "Suche",
                "description": "Schon während des Tippens werden die Suchergebnisse einer Suche innerhalb einer Datei angezeigt."
            },
            {
                "name": "Suchergebnis-Markierung",
                "description": "Suchergebnisse werden durch gelbe Striche entlang der Scrollbar angezeigt."
            }
        ]
    },
    {
        "buildNumber": 8873,
        "versionString": "Sprint 30",
        "dateString": "29.08.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-30",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Unterstützung für OS X 10.6 wiederhergestellt",
                "description": "Brackets stürzt beim Starten nicht mehr ab, wenn das Programm auf Mac OS X 10.6.x ausgeführt wird."
            },
            {
                "name": "Verbesserungen und Korrekturen für die Linux-Vorschau",
                "description": "Löschen von Dateien, Erweiterungs-Verwaltung und HTML-Hervorhebung in der Live-Vorschau sind jetzt aktiviert. Außerdem haben wir mehrere Fehler beim Installieren des Debian-Pakets behoben."
            },
            {
                "name": "Hinweise für benannte Flows für CSS-Regionen",
                "description": "Benannte Flows für CSS-Regionen erscheinen jetzt in Code-Hinweisen für die Eigenschaften flow-into und flow-from."
            },
            {
                "name": "Hinweise für Funktionsparameter",
                "description": "Hinweise erscheinen automatisch, wenn Sie zum ersten Mal innerhalb von Klammern tippen, oder wenn sie manuell mit Strg+Umschalt+Leer aufgerufen werden."
            },
            {
                "name": "Alle ersetzen",
                "description": "Alle ersetzen zeigt ein Paneel mit allen Vorkommnissen an, die ersetzt werden. Sie können die Vorkommnisse begutachten und die Haken bei den Einträgen entfernen, die Sie nicht ersetzen wollen."
            },
            {
                "name": "Hinweis: Update der Erweiterung Theseus erforderlich",
                "description": "Alle Nutzer der Erweiterung Theseus müssen updaten, da vorherige Versionen nicht kompatibel sind. Außerdem können Brackets-Entwickler jetzt Theseus verwenden, um eine Instanz von Brackets zu debuggen."
            },
            {
                "name": "Geupdatete Übersetzungen",
                "description": "Die Übersetzungen auf Französisch, Japanisch, Deutsch und Türkisch wurden geupdatet."
            }
        ]
    },
    {
        "buildNumber": 8678,
        "versionString": "Sprint 29",
        "dateString": "09.08.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-29",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Hinweis: Startet nicht bei OS X 10.6",
                "description": "Upgraden Sie nicht, wenn Sie Mac OS X 10.6.x nutzen, da dieser Sprint dort nicht startet. Wir haben die Ursache ermittelt und hoffen, das Problem in Sprint 30 zu beheben. In der Zwischenzeit verwenden Sie bitte Sprint 26 oder früher, falls Sie Snow Leopard nutzen."
            },
            {
                "name": "In Dateien suchen: Alle Ergebnisse anzeigen und zum Arbeitsbereich hinzufügen",
                "description": "In Dateien suchen zeigt jetzt mehr als 100 Ergebnisse an. Sie können auf ein Ergebnis doppelklicken, um die Datei zum Arbeitsbereich hinzuzufügen."
            },
            {
                "name": "\"Öffnen mit…\"-Unterstützung für Finder (nur Mac)",
                "description": "Brackets wird jetzt in Finder im \"Öffnen mit…\"-Kontextmenü für unterstützte Dateitypen angezeigt."
            },
            {
                "name": "Neue Unterstützung für Finnisch und aktualisierte Übersetzungen",
                "description": "Eine neue finnische Übersetzung wurde für Brackets erstellt. Die französischen, japanischen, tschechischen, deutschen und schwedischen Übersetzungen wurden geupdatet."
            }
        ]
    },
    {
        "buildNumber": 8528,
        "versionString": "Sprint 28",
        "dateString": "29.07.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-28",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Hinweis: Startet nicht bei OS X 10.6",
                "description": "Upgraden Sie nicht, wenn Sie Mac OS X 10.6.x nutzen, da Sprints 27 und 28 dort nicht starten. Wir haben die Ursache ermittelt und hoffen, das Problem in Sprint 30 zu beheben. In der Zwischenzeit verwenden Sie bitte Sprint 26 oder früher, falls Sie Snow Leopard nutzen."
            },
            {
                "name": "Neues unbenanntes Dokument",
                "description": "Datei > Neu erstellt jetzt ein leeres unbenanntes Dokument im Speicher, wie in anderen Texteditoren; Sie werden beim Speichern nach einem Dateinamen gefragt. Sie können immer noch direkt eine neue Datei auf der Festplatte anlegen, indem Sie im Kontextmenü des Dateibaums auf Neue Datei klicken."
            },
            {
                "name": "Erweiterungen vom Server installieren",
                "description": "Die Erweiterungs-Verwaltung hat jetzt einen Tab, auf dem verfügbare Erweiterungen für Brackets aufgeführt werden. Sie können eine Erweiterung aus der Liste mit einem Klick installieren oder auf die neueste Version updaten. Entwickler können Erweiterungen über brackets-registry.aboutweb.com auf den Server hochladen."
            },
            {
                "name": "Drag and Drop vom Betriebssystem",
                "description": "Sie können jetzt Dateien vom Betriebssystem auf das Brackets-Fenster ziehen, um sie zu öffnen. Sie können auch einen Ordner auf das Brackets-Fenster ziehen, um ihn in der Seitenleiste zu öffnen."
            },
            {
                "name": "Animationen für Schnell-Editor und Schnellansicht",
                "description": "Die Schnell-Editor-Ansichten werden jetzt beim Öffnen und Schließen animiert, und das Schnellansicht-Popup hat einen subtilen Vergrößerungs-Effekt."
            }
        ]
    },
    {
        "buildNumber": 8254,
        "versionString": "Sprint 27",
        "dateString": "26.06.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-27",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "OS X 10.6-Fehler",
                "description": "Upgraden Sie nicht, wenn Sie Mac OS X 10.6.x verwenden, da Sprint 27 dort nicht startet. Dieser Fehler tritt in neueren Versionen von OS X nicht auf. Wir hoffen, diesen Fehler in Sprint 30 zu beheben. Entschuldigung."
            },
            {
                "name": "Speichern unter",
                "description": "Speichern Sie eine Kopie einer Datei mit dem Menü Datei > Speichern unter …, über das Kontextmenü des Projektbaums, oder mit dem Tastenkürzel Strg+Umschalt+S or ⇧⌘S."
            },
            {
                "name": "Aktualisierte Unterstützung für Farbverläufe in der Schnellansicht",
                "description": "Die Schnellansicht für Farbverläufe unterstützt jetzt das Schlüsselwort \"to\" für die Richtung und die neuen Typen repeating-linear-gradient und repeating-radial-gradient."
            },
            {
                "name": "Neue Unterstützung für Ungarisch und Sprachupdates",
                "description": "Eine neue ungarische Übersetzung wurde für Brackets erstellt. Die Übersetzungen auf Französisch, Tschechisch und Spanisch wurden geupdatet."
            },
            {
                "name": "Neue Native Shell",
                "description": "Unter der Haube verwendet Brackets jetzt eine neue Version des Chromium Embedded Frameworks. Es gibt keine nennenswerten sichtbaren Änderungen, doch bitte melden Sie Fehler, wenn Sie irgendwelche Probleme bemerken."
            }
        ]
    },
    {
        "buildNumber": 8034,
        "versionString": "Sprint 26",
        "dateString": "10.06.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-26",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Installierte Erweiterungen updaten",
                "description": "Die Erweiterungs-Verwaltung kann jetzt eine installierte Erweiterung updaten, ohne dass die Erweiterung zuvor manuell deinstalliert werden muss."
            },
            {
                "name": "Neues Design der Statusleiste",
                "description": "Visuelle Updates für die Statusleiste, einschließlich neuer Symbole für die JSLint-Validierung."
            },
            {
                "name": "JSLint-Fehler anzeigen/ausblenden",
                "description": "Wenn JSLint-Fehler auftreten, klicken Sie auf das Statussymbol in der Statusleiste, um das JSLint-Panel anzuzeigen/auszublenden."
            },
            {
                "name": "URL-Hinweise in CSS",
                "description": "In einer @import- oder url()-Anweisung zeigen Code-Vorschläge relative Pfade zu Dateien in Ihrem Projekt."
            },
            {
                "name": "Dialog-Schaltfläche OK/Abbrechen in Windows",
                "description": "OK- und Abbrechen-Schaltflächen in Dialogen werden jetzt in der richtigen Reihenfolge angezeigt. Vorher war die Reihenfolge vertauscht."
            },
            {
                "name": "Architektur: Updates für jQuery, Bootstrap und LESS",
                "description": "Unter der Haube verwendet Brackets jetzt neuere Versionen von jQuery, Bootstrap und LESS. Es gibt keine nennenswerten sichtbaren Änderungen, doch bitte melden Sie Fehler, wenn Sie irgendwelche Probleme feststellen."
            }
        ]
    },
    {
        "buildNumber": 7567,
        "versionString": "Sprint 25",
        "dateString": "21.05.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-25",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Erweiterungs-Verwaltung",
                "description": "Mit dem Symbolleisten-Icon oder über Datei > Erweiterungs-Verwaltung… können Sie installierte Erweiterungen anzeigen, suchen und entfernen. Um neue Erweiterungen zu installieren, verwenden Sie die Schaltfläche Von URL installieren… in der Erweiterungs-Verwaltung."
            },
            {
                "name": "Dateien/Ordner löschen",
                "description": "Dateien und Ordner können mit dem Kontextmenü oder über Datei > Löschen aus dem Dateibaum gelöscht werden."
            },
            {
                "name": "Im Betriebssystem anzeigen",
                "description": "Klicken Sie mit der rechten Maustaste auf eine Datei oder einen Ordner, und wählen Sie Im Betriebssystem anzeigen, um den Pfad im Mac-Finder oder Windows-Explorer anzuzeigen."
            },
            {
                "name": "Verlässlichkeit der Live-Vorschau",
                "description": "Auf allen Plattformen zeigt Brackets eine Benachrichtigung an, wenn die Live-Vorschau getrennt wird. In Windows ist das Starten und Finden von Chome jetzt verlässlicher."
            },
            {
                "name": "Verbesserungen für die JavaScript-Code-Intelligenz",
                "description": "Das schnelle Bearbeiten von JavaScript verwendet jetzt die Tern-basierte Code-Intelligenz-Engine, um Funktions-Definitionen zu finden. Außerdem haben wir Fehler in den JavaScript-Code-Vorschlägen behoben und die Geschwindigkeit optimiert."
            },
            {
                "name": "Eingabe-Performance",
                "description": "Ein Fehler wurde behoben, der die Eingabegeschwindigkeit merklich verlangsamte."
            }
        ]
    },
    {
        "buildNumber": 7204,
        "versionString": "Sprint 24",
        "dateString": "26.04.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-24",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Neue Schnellansicht",
                "description": "Zeigen Sie mit der Maus auf Farbwerte, Farbverläufe und Bild-Werte, damit eine Inline-Vorschau angezeigt wird."
            },
            {
                "name": "Neue Schnell-Dokumentation für CSS",
                "description": "Drücken Sie Strg+K oder ⌘K bei einer CSS-Eigenschaft, um von die der Community geschriebene Dokumentation von WebPlatform.org anzuzeigen."
            },
            {
                "name": "Erweiterte JavaScript-Code-Intelligenz",
                "description": "Neue JavaScript-Code-Intelligenz, basierend auf dem Tern-Project. Verbesserte Genauigkeit bei Code-Vorschlägen, Unterstützung für camelCase sowie eingebaute Intelligenz für RequireJS und jQuery."
            },
            {
                "name": "Definition schnell finden",
                "description": "Finden Sie eine Funktion oder Eigenschafts-Definition in Ihrem Projekt auf Anhieb, indem Sie Strg+J oder ⌘J drücken."
            },
            {
                "name": "Vorschläge für Funktions-Argumente / Signaturen",
                "description": "Drücken Sie Strg+Leertaste innerhalb der () eines Funktions-Aufrufs, um Informationen über die Argumente und ihre Datentypen zu erhalten."
            },
            {
                "name": "Neues Design des Projekt-Panels",
                "description": "Visuelle Updates für das Projekt-Panel."
            },
            {
                "name": "Erweiterungen von Symbolleiste aus installieren",
                "description": "Installieren Sie Erweiterungen direkt mithilfe der Symbolleiste."
            }
        ]
    },
    {
        "buildNumber": 6726,
        "versionString": "Sprint 23",
        "dateString": "10.04.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-23",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "HTML-Highlight mit Live-Vorschau",
                "description": "Während die Live-Vorschau aktiv ist, setzen Sie den Cursor auf ein HTML-Element, um das Element im Browser hervorzuheben. Das Hervorheben kann mit Ctrl+Shift+C oder ⇧⌘C ein- und ausgeschaltet werden. Diese Funktion wird momentan nur für Dateien mit gespeicherten Änderungen unterstützt."
            },
            {
                "name": "Neue Symbolleiste",
                "description": "Eine neue Symbolleiste ist jetzt rechts in Brackets angedockt. Sie ersetzt die obere Titelleiste und die HTML-Menüs. Symbole für Live-Vorschau und andere Erweiterungen können hier gefunden werden."
            },
            {
                "name": "Neue Unterstützung für Polnisch und Sprach-Updates",
                "description": "Eine neue polnische Übersetzung wurde für Brackets erstellt. Die Übersetzungen auf Französisch, Deutsch, Tschechisch und Chinesisch wurden auf den neusten Stand gebracht."
            }
        ]
    },
    {
        "buildNumber": 6428,
        "versionString": "Sprint 22",
        "dateString": "22.03.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-22",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Einfachere Installation von Erweiterungen",
                "description": "Installieren Sie Erweiterungen in der Brackets-Oberfläche via Datei > Erweiterungen installieren…. Eine URL zu einer ZIP-Datei oder einem Github-Repo ist erforderlich."
            },
            {
                "name": "Zeilenumbruch",
                "description": "Zeilenumbruch ist jetzt standardmäßig eingeschaltet. Verwenden Sie zum Ein-/Ausschalten das Menü Ansicht > Zeilenumbruch."
            },
            {
                "name": "Aktive Zeile hervorheben",
                "description": "Hiermit wird die Zeile hervorgehoben, in der sich der Cursor befindet. Verwenden Sie zum Ein-/Ausschalten das Menü Ansicht > Aktive Zeile hervorheben."
            },
            {
                "name": "Zeilennummern ausblenden",
                "description": "Zeilennummern können jetzt ausgeblendet werden. Verwenden Sie zum Ein-/Ausschalten das Menü Ansicht > Zeilennummern."
            },
            {
                "name": "Verlässlichkeit der Live-Entwicklung",
                "description": "Verbesserungen und Fehlerkorrekturen wurden gemacht, um die Verbindung zu Chrome verlässlicher zu machen, und um Fehler effektiver zu berichten."
            },
            {
                "name": "Neue/Aktualisierte Übersetzungen",
                "description": "Eine neue chinesische Übersetzung wurde hinzugefügt. Außerdem wurden die französische, japanische, deutsche und italienische Übersetzung aktualisiert."
            }
        ]
    },
    {
        "buildNumber": 5990,
        "versionString": "Sprint 21",
        "dateString": "01.03.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-21",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "JavaScript-Code-Vorschläge",
                "description": "Die neuen Code-Vorschläge für JavaScript beinhalten Schlüsselwörter, lokale Variablen, Argumente und Eigenschaften-Namen."
            },
            {
                "name": "Live-Entwicklung standardmäßig auf Localhost (mit Node.js)",
                "description": "Standardmäßig verwendet die Live-Entwicklung einen eingebauten Webserver, umgesetzt mit node.js."
            },
            {
                "name": "Auf Dock ziehen, um Dateien zu öffnen (OSX)",
                "description": "Ziehen Sie eine Datei direkt auf das Dock-Symbol von Brackets, um sie zu öffnen."
            },
            {
                "name": "Ziehen und Ablegen, um Dateien zu öffnen (Windows)",
                "description": "Ziehen Sie eine Datei direkt in Brackets, um sie zu öffnen."
            },
            {
                "name": "Cursor- und Scroll-Position merken",
                "description": "Bei Dateien, die beim Beenden noch offen sind, werden die Cursor- und Scroll-Position beim erneuten Starten beibehalten. Während einer Sitzung werden die Cursor- und Scroll-Position für geschlossene Dateien beim erneuten Öffnen beibehalten."
            }
        ]
    },
    {
        "buildNumber": 5672,
        "versionString": "Sprint 20",
        "dateString": "14.02.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-20",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Upgrade auf CodeMirrot 3",
                "description": "Der zentrale Code-Editor wurde auf CodeMirror 3 aktualisiert, was viele Probleme behebt und neue Funktionen ermöglicht."
            },
            {
                "name": "Verbessertes Rückgängig/Wiederholen",
                "description": "Rückgängig stellt die alte Auswahl und Cursor-Position wieder her."
            },
            {
                "name": "Zeilennummern immer sichtbar",
                "description": "Die Zeilennummern am linken Rand bleiben beim horizontalen Scrollen sichtbar."
            },
            {
                "name": "Doppel-/Dreifach-Klick-und-Ziehen",
                "description": "Doppel-Klick-ziehen und Dreifach-Klick-ziehen Sie, um mehrere Wörter/Zeilen schnell zu markieren."
            },
            {
                "name": "Verbesserte Suchfunktion",
                "description": "Alle Suchergebnisse werden hervorgehoben, wenn die Suchleiste offen ist. Das aktuelle Ergebnis wird im Editor zentriert."
            }
        ]
    },
    {
        "buildNumber": 5242,
        "versionString": "Sprint 19",
        "dateString": "18.01.2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-19",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Native Menüleiste",
                "description": "Menüs erscheinen jetzt als native Menüs in Mac/Windows."
            },
            {
                "name": "CSS-Code-Vorschläge",
                "description": "Code-Vorschläge für CSS-Eigenschaften und -Werte erscheinen jetzt für CSS-Dateien und <style>-Blöcke."
            },
            {
                "name": "Verbesserungen beim Schnellen Öffnen und Gehe zu Definition",
                "description": "Die Reihenfolge der Ergebnisse und Antwortzeiten wurden verbessert."
            },
            {
                "name": "Hervorgehobene Such-Ergebnisse",
                "description": "Beim Suchen werden alle Ergebnisse in der aktuellen Datei in Gelb hervorgehoben."
            },
            {
                "name": "Änderungen bei Mac-Tastenkürzeln",
                "description": "Block (aus-)kommentieren verwendet jetzt ⌘⌥/. ⌘←, zuvor als Zeilenanfangs-Kürzel verwendet, dient jetzt als intelligentes Zeilenanfangs-Kürzel. Das bedeutet, dass der Cursor zum ersten Nicht-Leerzeichen in der Zeile gesetzt wird."
            },
            {
                "name": "Neue/Aktualisierte Übersetzungen",
                "description": "Neue schwedische und portugiesische Übersetzungen wurden hinzugefügt. Auch wurde die französische, russische, spanische und  türkische Übersetzung aktualisiert."
            }
        ]
    },
    {
        "buildNumber": 5070,
        "versionString": "Sprint 18",
        "dateString": "20.12.2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-18",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Verbesserungen beim Umschalten von Kommentaren für CSS/HTML",
                "description": "Verschiedene Fehler beim Verarbeiten vom Umschalten bei Zeilen- und Block-Kommentaren in CSS- und HTML-Dateien."
            },
            {
                "name": "Filterung von HTML-Attributen in Code-Vorschlägen",
                "description": "Beim Anzeigen von Code-Vorschlägen für Attribute werden die bestehenden Attribute des Tags nicht erneut vorgeschlagen."
            },
            {
                "name": "Datei im Arbeitsbereich umbenennen",
                "description": "Klicken auf die aktive Datei im Arbeitsbereich bewirkt ein Umbenennen der Datei."
            },
            {
                "name": "Neue/Aktualisierte Übersetzungen",
                "description": "In diesem Sprint wurde eine neue russische Übersetzung beigesteuert. Auch die deutschen und spanischen Übersetzungen wurden aktualisiert."
            }
        ]
    },
    {
        "buildNumber": 4728,
        "versionString": "Sprint 17",
        "dateString": "30.11.2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-17",
        "downloadURL": "https://github.com/adobe/brackets/downloads",
        "newFeatures": [
            {
                "name": "Inline Color Picker",
                "description": "When the cursor is on a hex, rgb() or hsl() color, you can use Ctrl-E or ⌘E to edit the color inline."
            },
            {
                "name": "CSS Highlighting in Live Preview",
                "description": "While Live Preview is active, putting the cursor in a rule in a CSS file highlights items affected by that rule in the browser."
            },
            {
                "name": "Block Comment/Uncomment",
                "description": "Use Ctrl-Shift-/ or ⌘⇧/ to toggle block comments around the current selection."
            },
            {
                "name": "Find in File or Folder",
                "description": "You can now search the contents of a specific file or folder by choosing \"Find in…\" from the context menu in the file tree."
            },
            {
                "name": "New/Updated Translations",
                "description": "A new Turkish translation for Brackets was added and the Japanese, German, Spanish, French and Italian translations were updated, all by community members."
            }
        ]
    },
    {
        "buildNumber": 4439,
        "versionString": "Sprint 16",
        "dateString": "06.11.2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-16",
        "downloadURL": "https://github.com/adobe/brackets/downloads",
        "newFeatures": [
            {
                "name": "URL Mapping for Live Preview",
                "description": "You can now use Live Preview with server-based content by specifying a base URL in Project Settings."
            },
            {
                "name": "Extensions Stored Outside of the Application Folder",
                "description": "Extensions are now stored per user. Windows: C:\\Users\\<user>\\AppData\\Roaming\\Brackets\\extensions. Mac: /Users/<user>/Library/Application Support/Brackets/extensions."
            },
            {
                "name": "Working Set Sorting and Reordering",
                "description": "Sort by name, type or time added by choosing an option from the context menu. Also, the working set may be reordered using drag and drop."
            },
            {
                "name": "New/Updated Translations",
                "description": "A new Japanese translation for Brackets was added and the German translation has been updated (both are community contributed)."
            },
            {
                "name": "Improved Quick Open",
                "description": "Quick Open now searches on the whole path (not just filename), and accepts CamelCase abbreviations and other non-contiguous matches."
            }
        ]
    },
    {
        "buildNumber": 4083,
        "versionString": "Sprint 15",
        "dateString": "18.10.2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-15",
        "downloadURL": "https://github.com/adobe/brackets/downloads",
        "newFeatures": [
            {
                "name": "Status Bar",
                "description": "Displays cursor info, file size, file type, JSLint notification, indentation preferences and busy spinner."
            },
            {
                "name": "Indentation Preferences",
                "description": "Toggle between indentation via tabs or spaces and set the indentations size from the status bar."
            },
            {
                "name": "Auto Reload in Live Preview",
                "description": "Reloads the browser when saving non-CSS files."
            },
            {
                "name": "Resizable Bottom Panels",
                "description": "Search Results and JSLint panels can now resize vertically."
            },
            {
                "name": "Incremental Find",
                "description": "Highlights the first matching result when typing in the Find dialog."
            },
            {
                "name": "Delete Line",
                "description": "Ctrl+Shift+D or ⌘⇧D to delete the current line or lines if there is a selection."
            },
            {
                "name": "Code Hints for Relative URLs",
                "description": "href and src attributes show relative paths for files on disk."
            },
            {
                "name": "New Folder",
                "description": "Create a new folder using the File > New Folder menu item or when right clicking in the project tree."
            },
            {
                "name": "Rename Files and Folders",
                "description": "Right click on a file or folder in the project tree and choose Rename."
            },
            {
                "name": "Show in File Tree",
                "description": "Navigate > Show in File Tree menu item will highlight the current file."
            },
            {
                "name": "New Translations",
                "description": "Italian and Brazilian Portuguese community contributed translations."
            }
        ]
    },
    {
        "buildNumber": 3791,
        "versionString": "Sprint 14",
        "dateString": "20.09.2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-14",
        "downloadURL": "https://github.com/adobe/brackets/downloads",
        "newFeatures": [
            {
                "name": "New Editor Font: Source Code Pro",
                "description": "Brackets now uses a new, open-source monospace font called Source Code Pro."
            },
            {
                "name": "Help Menu",
                "description": "Moved Debug menu items \"Show Extensions Folder\" and \"Check for Updates\" to a new Help menu."
            },
            {
                "name": "Improved Development Workflow",
                "description": "See the brackets-shell README."
            },
            {
                "name": "Finished French Localization",
                "description": "Both the application and installers are now localized in French."
            },
            {
                "name": "Version Info",
                "description": "Version info can be accessed via the Help > About menu."
            }
        ]
    }
]
