[
    {
        "buildNumber": 12894,
        "versionString": "Sprint 39",
        "dateString": "09-05-2014",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-39",
        "downloadURL": "http://brackets.io",
        "newFeatures": [
            {
                "name": "Sugerencias de código para CSS más inteligentes",
                "description": "Las sugerencias de Código para CSS ahora utilizan el mismo algoritmo de correspondencia de cadenas que la Apertura Rápida y las sugerencias de código para JavaScript. Por ejemplo, si escribe \"blc\" obtendrá la sugerencia \"border-left-color\"."
            },
            {
                "name": "Notificaciones de actualizaciones de extensiones",
                "description": "El icono en la barra de herramientas para el Administrador de Extensiones ahora cambia a color verde indicando que hay una o más extensiones que tienen actualizaciones esperando a ser instaladas."
            },
            {
                "name": "Nuevo menú Buscar",
                "description": "Los comandos de Búsqueda se movieron desde el menú Edición a un nuevo menú Buscar para reducir el tamaño del menú Edición y que sean más fáciles de ubicar."
            },
            {
                "name": "Mejoras en la Edición",
                "description": "Cortar y Copiar ahora cortará o copiará la línea entera donde está ubicado el cursor cuando no hay nada seleccionado. También funciona con múltiples cursores."
            },
            {
                "name": "Manejo de archivos binarios en Windows y Linux",
                "description": "La apertura de un archivo binario o de otros archivos no codificados con UTF8 en Linux y Windows ahora tendrá como resultado un mensaje de error en lugar de texto confuso, y las búsqueda en archivos omitirá esos archivos, mejorando el rendimiento. Esto coincide con el comportamiento existente Mac."
            },
            {
                "name": "Mapee nombres de archivos y extensiones a un lenguaje de programación",
                "description": "Ahora podrá agregar una preferencia para ajustar el resaltado de sintaxis del editor y otras características del lenguaje de programación para los archivos basados en un nombre de archivo o extensión."
            },
            {
                "name": "Traducción al Croata",
                "description": "Brackets tiene una nueva traducción al Croata realizada por la comunidad."
            }
        ]
    },
    {
        "buildNumber": 12606,
        "versionString": "Sprint 38",
        "dateString": "14-04-2014",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-38",
        "downloadURL": "http://brackets.io",
        "newFeatures": [
            {
                "name": "Múltiples cursores y selecciones",
                "description": "Cree múltiples cursores, selecciones discontinuas, y selecciones rectangulares para realizar ediciones similares en varios lugares al mismo tiempo."
            },
            {
                "name": "Agregar coincidencias a la selección",
                "description": "Rápidamente agregue la siguiente instancia de la palabra o rango seleccionado a la selección múltiple con ⌘B/Ctrl+B, o agregue todas las instancias con ⌘⌃G/Alt-F3. Muy útil para renombrar."
            },
            {
                "name": "Deshacer selección",
                "description": "Deshaga el último cambio o edición sobre la selección múltiple con ⌘U/Ctrl+U, y rehaga con ⌘⇧U/Ctrl+Shift+U. Esto es útil para corregir un error en la selección múltiple o para saltar a la ubicación de una selección anterior."
            },  
            {
                "name": "Colapsar todos los hijos",
                "description": "Use ⌘⌥Click/Ctrl+Alt+Click para colapsar todos los hijos de la carpeta seleccionada en el árbol de archivos."
            },
            {
                "name": "Devolución de resultados en la Edición rápida",
                "description": "La Edición Rápida (⌘E/Ctrl+E) y la Documentación Rápida (⌘K/Ctrl+K) ahora mostrarán información útil cuando se invocan en elementos de código que no admiten los comandos."
            },            
            {
                "name": "Soporte para archivos .ico en la Vista previa de imágenes",
                "description": "Ahora puede seleccionar archivos con formato .ico desde el árbol de directorios para ver una vista previa de los mismos."
            },
            {
                "name": "API para sugerencias de código asincrónico",
                "description": "Los códigos para las sugerencias de código ahora pueden devolver los resultados de forma asincrónica, mejorando la capacidad de respuesta y el rendimiento."
            }
        ]
    },            
    {
        "buildNumber": 12014,
        "versionString": "Sprint 37",
        "dateString": "17-03-2014",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-37",
        "downloadURL": "http://brackets.io",
        "newFeatures": [
            {
                "name": "Excluir archivos/carpetas en la Búsqueda en archivos",
                "description": "Especifique nombres de archivos y carpetas o comodines para excluir en múltiples búsquedas."
            },
            {
                "name": "Instaladores firmados para Mac y Windows",
                "description": "El instalador de Brackets ahora esta firmado en Mac y Windows, haciendo que la instalación y las actualizaciones sean más fáciles."
            },
            {
                "name": "Mejoras en la infraestructura de las preferencias",
                "description": "El nuevo API para las Preferencias ahora esta listo para ser usado por las extensiones. Además, se agregaron nuevas preferencias: mire http://is.gd/BracketsPrefs para la documentación."
            },
            {
                "name": "Instale extensiones por proxies",
                "description": "Ahora puede setear el \"proxy\" por medio de las preferencias para habilitar a Brackets a instalar extensiones por detrás de un servidor proxy. Mire http://is.gd/BracketsPrefs para más información."
            },
            {
                "name": "Mejoras en la Edición rápida para funciones de temporización",
                "description": "Ahora puede abrir la Edición Rápida en una función de temporización para animaciones incompleta (por ejemplo, \"cubic-bezier()\") para crear una curva bezier desde cero."
            },
            {
                "name": "Interfaz para el modo sobreescritura",
                "description": "El cursor ahora cambia en el modo sobreescritura, y puede intercambiar entre el modo insertar y el modo sobreescritura desde la barra de estado."
            },
            {
                "name": "Mejoras en el sistema de archivos y en la Vista previa en vivo",
                "description": "Se arreglaron errores críticos con cambios externos realizados sobre los archivos y errores en la Vista Previa en Vivo no arrancando correctamente."
            },
            {
                "name": "Nuevas traducciones",
                "description": "Se agrego una traducción a indonesio."
            }
        ]
    },
    {
        "buildNumber": 11506,
        "versionString": "Sprint 36",
        "dateString": "07-02-2014",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-36",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Preferencias mejoradas",
                "description": "Utilice archivos de configuración con formato JSON para especificar la configuración por carpeta o tipo de archivo."
            },
            {
                "name": "Mejorado el soporte para LESS",
                "description": "Las sugerencias de código CSS y la Documentación rápida ahora están disponibles al editar archivos LESS."
            },
            {
                "name": "Sistema de archivos y rendimiento",
                "description": "El editor y el árbol de archivos del proyecto se actualizarán automáticamente con los cambios externos. Operaciones, tales como Buscar en archivos, son mucho más rápidas."
            },
            {
                "name": "Extensiones",
                "description": "Hay un nuevo comando Desarrollo > Recargar sin extensiones para ayudar a solucionar problemas. Cuando se actualizan o remueven extensiones, Brackets se recargará automáticamente, por lo que salir y abrir Brackets nuevamente ya no es necesario."
            },
            {
                "name": "Edición rápida para animation timing",
                "description": "Cuando el cursor esta sobre la función CSS steps(), puede usar la Edición rápida (Ctrl+E/⌘E) para editar los parámetros visualmente."
            },
            {
                "name": "Actualizaciones en la interfaz en Windows",
                "description": "Se corrigieron muchos fallos en la ventana en Windows."
            },
            {
                "name": "Inspección de código",
                "description": "Múltiples extensiones pueden registrar inspectores de código para el mismo tipo de archivo y todos los resultados se mostraran juntos en el mismo panel de resultados."
            },
            {
                "name": "Nuevas traducciones",
                "description": "Nuevas traducciones de Griego y Coreano fueron agregadas a Brackets."
            }
        ]
    },
    {
        "buildNumber": 10897,
        "versionString": "Sprint 35",
        "dateString": "17-12-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-35",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Nueva interfaz para buscar/reemplazar",
                "description": "Reemplazar ahora usa una interfaz más ágil y clara que soporta las mismas características que Buscar, incluyendo búsqueda incremental y resaltado de resultados. Fueron agregados nuevos botones en Buscar, Buscar en archivos y Reemplazar que permiten activar la sensibilidad a mayúsculas y las expresiones regulares en las búsquedas."
            },
            {
                "name": "Activar Desarrollo en Vivo en Mac",
                "description": "En Mac, Chrome ahora no necesita ser reabierto cuando se activa Desarrollo en Vivo."
            },
            {
                "name": "Brackets arranca más rápido",
                "description": "Brackets ahora carga hasta un 50% más rápido gracias a la minificación de los archivos JavaScript y a la pre-compilación de los archivos LESS."
            }
        ]
    },
    {
        "buildNumber": 10733,
        "versionString": "(Hotfix) Sprint 34.1",
        "dateString": "03-12-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-34.1",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Arreglo que evita que Brackets se congele al abrir archivos JavaScript",
                "description": "Arregla el problema #6067: Abrir archivos JavaScript en carpetas que contiene cierto tipo de archivos causaba que Brackets se congele."
            },
            {
                "name": "Arreglo de problemas de interfaz con ciertos archivos LESS",
                "description": "Arregla el problema #6057: Abrir ciertos archivos LESS causaba que la interfaz del editor se volviera parcialmente blanca o mostrase otros problema técnicos."
            }            
        ]
    },  
    {
        "buildNumber": 10729,
        "versionString": "Sprint 34",
        "dateString": "15-11-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-34",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Actualizar instalaciones existentes de Brackets",
                "description": "Las próximas versiones de Brackets, a partir de la versión Sprint 35, se actualizarán sobre la instalación existente de Brackets. Nota: Las versiones Sprint 33 y anteriores todavía pueden estar instaladas de manera simultánea o desinstaladas."
            },
            {
                "name": "Mejoras gráficas",
                "description": "La versión de Mac tiene ahora una barra oscura, acorde con el resto del diseño de Brackets."
            },
            {
                "name": "Robustez de las sugerencias de código en JavaScript",
                "description": "Solucionados los problemas por los que las sugerencias se perdían en archivos de tamaño medio (500-2000 líneas) y en casos en los que se modificaban las propiedades exportadas de un módulo."
            },
            {
                "name": "Traducciones nuevas y actualizadas",
                "description": "Nuevas traducciones de Holandés, Persa y Rumano contribuidas por la comunidad. Las traducciones de Francés, Japonés, Portugués de Brasil, Checo, Finlandés, Alemán, Español y Sueco han sido actualizadas."
            },
            {
                "name": "Mejorada la API del sistema de archivos",
                "description": "Los autores de extensiones pueden ahora construir extensiones más robustas y eficientes utilizando la actualizada API del sistema de archivos. Las notas de la versión incluyen los detalles importantes y las pautas de migración."
            }
        ]
    },
    {
        "buildNumber": 10188,
        "versionString": "Sprint 33",
        "dateString": "29-10-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-33",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Vista previa de imágenes",
                "description": "Al seleccionar una imagen en el árbol de directorios se muestra una vista previa de la misma."
            },
            {
                "name": "Nueva regla CSS desde Edición Rápida",
                "description": "Usa el botón Nueva Regla en la Edición Rápida de CSS (Ctrl+E/⌘E) para crear una regla para el tag/class/id seleccionado, incluso si todavía no hay reglas. Puedes modificar el selector una vez se haya creado."
            },
            {
                "name": "Edición Rápida para Suavizado de Animaciones",
                "description": "Cuando la selección está en una \"animation timing function\" de CSS, puedes usar la Edición Rápida de CSS (Ctrl+E/⌘E) para modificar visualmente la curva de tiempo."
            },
            {
                "name": "Reemplazar en Expresiones Regulares",
                "description": "Al utilizar una expresión regular en buscar/reemplazar, puedes usar $1, $2, etc. en la cadena de reemplazo para hacer referencia a expresiones entre paréntesis en la cadena de búsqueda."
            },
            {
                "name": "Mejoras gráficas",
                "description": "Los widgets de Edición Gráfica tienen ahora un botón de cerrar. Buscar en archivos informa cuándo no hay resultados."
            },
            {
                "name": "Traducciones actualizadas",
                "description": "Las traducciones de Francés, Japonés, Alemán, Checo y Español han sido actualizadas."
            }
        ]
    },
    {
        "buildNumber": 9791,
        "versionString": "Sprint 32",
        "dateString": "10-04-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-32",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Launch Live Preview for non-HTML file",
                "description": "Brackets will automatically find a nearby index.html file to use. No more switching away from your CSS file to start Live Preview!"
            },
            {
                "name": "Faster Performance in Find as you Type",
                "description": "Initial keystrokes when typing in Find field (when the number of results is usually very high) are improved."
            },
            {
                "name": "Update Node to Version 0.10",
                "description": "This is an 'Under the Hood' change."
            },
            {
                "name": "Improved Linting API",
                "description": "Extension authors can now drive linting engine headlessly."
            },
            {
                "name": "Updated Translations",
                "description": "French, Japanese, German, Czech, Finnish, and Turkish translations have been updated."
            }
        ]
    },
    {
        "buildNumber": 9569,
        "versionString": "Sprint 31",
        "dateString": "09-20-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-31",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Live Preview for HTML",
                "description": "Live Preview updates in real time as you type in HTML files. Updates pause whenever the HTML is not syntactically valid."
            },
            {
                "name": "Windows UI",
                "description": "Windows now has a dark titlebar. A similar change will be coming soon for Mac too."
            },
            {
                "name": "Keyboard Support for Recent Projects",
                "description": "Press Ctrl+Alt+R (⌘⌥R) to open the 'recent projects' dropdown, then use the arrows and Enter to switch projects."
            },
            {
                "name": "CSS Code Hints in SCSS",
                "description": "Code hints for CSS property names & values: The same code hints you see in CSS files will now also appear in SCSS files. Quick Docs for CSS properties: Ditto – just like in CSS."
            },
            {
                "name": "HTML Matching Tag Highlighting",
                "description": "Highlight matching open/close tag."
            },
            {
                "name": "Search",
                "description": "Update Find in Files results while typing."
            },
            {
                "name": "Search Result Tickmarks",
                "description": "Find results are visually mapped out as yellow tickmarks along the scroll bar track."
            }
        ]
    },
    {
        "buildNumber": 9116,
        "versionString": "Sprint 30",
        "dateString": "08-29-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-30",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "OS X 10.6 Support Restored",
                "description": "Brackets will no longer crash on launch when running on Mac OS X 10.6.x."
            },
            {
                "name": "Linux Preview Improvements & Fixes",
                "description": "File delete, Extension Manager and HTML Highlighting in Live Preview are now enabled. Also, we've fixed several bugs when installing the Debian package."
            },
            {
                "name": "CSS Regions Named Flow Code Hints",
                "description": "Named Flows for CSS regions will now appear in code hints for flow-into and flow-from properties."
            },
            {
                "name": "Function Parameter Hints",
                "description": "Hints appear automatically when you first type inside parentheses, or when invoked manually with Ctrl+Shift+Space."
            },
            {
                "name": "Replace All",
                "description": "Replace All displays a panel showing all occurrences that will be replaced. You can review and uncheck any occurrences you don't want to replace."
            },
            {
                "name": "Note: Theseus Extension Update Required",
                "description": "All users of the Theseus extension must update due to a break in compatibility. Also, Brackets developers can now use the Theseus to debug an instance of Brackets."
            },
            {
                "name": "Updated Translations",
                "description": "The French, Japanese, German, and Turkish translations have been updated."
            }
        ]
    },
    {
        "buildNumber": 8678,
        "versionString": "Sprint 29",
        "dateString": "08-09-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-29",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Note: Does Not Launch on OS X 10.6",
                "description": "Do not upgrade if you are running Mac OS X 10.6.x, as this sprint will not launch. We've tracked down the cause and hope to fix it in Sprint 30. In the meantime, if you are on Snow Leopard, use Sprint 26 or earlier."
            },
            {
                "name": "Find in Files: View All Results and Add to Working Set",
                "description": "Find in Files now displays more than 100 results. You may double click on a result to add the file to the working set."
            },
            {
                "name": "\"Open With…\" support for Finder (Mac only)",
                "description": "Brackets is now displayed in the \"Open With…\" Finder context menu for supported file types."
            },
            {
                "name": "New Finnish Support and Updated Translations",
                "description": "A new Finnish translation has been created for Brackets. The French, Japanese, Czech, German, and Swedish translations have been updated."
            }
        ]
    },
    {
        "buildNumber": 8528,
        "versionString": "Sprint 28",
        "dateString": "07-29-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-28",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Note: Does Not Launch on OS X 10.6",
                "description": "Do not upgrade if you are running Mac OS X 10.6.x, as Sprints 27 and 28 will not launch. We've tracked down the cause and hope to fix it in Sprint 29. In the meantime, if you are on Snow Leopard, use Sprint 26 or earlier."
            },
            {
                "name": "New Untitled Document",
                "description": "File > New now creates a blank untitled document in memory, as in other text editors; you will be prompted for a filename on save. You can still directly create a new file on disk by choosing New File from the context menu in the file tree."
            },
            {
                "name": "Install Extensions from Registry",
                "description": "The Extension Manager now has a tab that lists available extensions for Brackets. You can install an extension from the list or update to the latest version of an extension with a single click. Developers can upload extensions to the registry at brackets-registry.aboutweb.com."
            },
            {
                "name": "Drag and Drop from OS",
                "description": "You can now drag files from the OS onto the Brackets window in order to open them. You can also drag a folder onto the Brackets window to open it in the sidebar."
            },
            {
                "name": "Quick Edit and Quick View animations",
                "description": "Quick Edit views now animate open and closed, and the Quick View popup has a subtle grow effect."
            }
        ]
    },
    {
        "buildNumber": 8254,
        "versionString": "Sprint 27",
        "dateString": "06-26-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-27",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "OS X 10.6 Issue",
                "description": "Do not upgrade if you are running Mac OS X 10.6.x, as Sprint 27 fails to load. Newer versions of OS X are unaffected by this issue. We hope to fix this bug in Sprint 28. Sorry."
            },
            {
                "name": "Save As",
                "description": "Save a copy of a file using the File > Save As… menu, project tree context menu, or with the keyboard shortcut Ctrl+Shift+S or ⇧⌘S."
            },
            {
                "name": "Updated Quick View Gradient Support",
                "description": "Quick View for gradients now supports the \"to\" keyword for gradient direction and new repeating-linear-gradient and repeating-radial-gradient types."
            },
            {
                "name": "New Hungarian Support and Language Updates",
                "description": "A new Hungarian translation has been created for Brackets. French, Czech and Spanish translations have been updated."
            },
            {
                "name": "New Native Shell",
                "description": "Under the hood, Brackets is now using a new version of the Chromium Embedded Framework. There are no significant user-facing changes, but please do report bugs if you experience any problems."
            }
        ]
    },
    {
        "buildNumber": 8034,
        "versionString": "Sprint 26",
        "dateString": "06-10-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-26",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Update Installed Extensions",
                "description": "Extension Manager can now update an installed extension without manually uninstalling the extension first."
            },
            {
                "name": "New Status Bar Design",
                "description": "Visual updates to the status bar including new icons for JSLint validation."
            },
            {
                "name": "Show/Hide JSLint Errors",
                "description": "When JSLint errors are present, click on the status icon in the status bar to show/hide the JSLint panel."
            },
            {
                "name": "URL Hints in CSS",
                "description": "In an @import or url() statement, code hints will show relative paths to files in your project."
            },
            {
                "name": "OK/Cancel Dialog Buttons on Windows",
                "description": "OK and Cancel buttons in dialogs now display in the correct order. Previously the order was reversed."
            },
            {
                "name": "Architecture: jQuery, Bootstrap and LESS updates",
                "description": "Under the hood, Brackets is now using newer versions of jQuery, Bootstrap and LESS. There are no significant user-facing changes, but please do report bugs if you experience any problems."
            }
        ]
    },
    {
        "buildNumber": 7701,
        "versionString": "Sprint 25",
        "dateString": "05-26-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-25",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Extension Manager",
                "description": "From the toolbar icon or File > Extension Manager… you can view, search and remove installed extensions. To install new extensions, use the Install from URL… button in the Extension Manager."
            },
            {
                "name": "Delete Files/Folders",
                "description": "Files and folders can be deleted from the file tree using the context menu or File > Delete."
            },
            {
                "name": "Show in OS",
                "description": "Right click on a file or folder and choose Show in OS to open the location in Mac Finder or Windows Explorer."
            },
            {
                "name": "Refresh File Tree",
                "description": "Right-click on the file tree and choose Refresh to update the file list from disk."
            },
            {
                "name": "Live Preview Reliability",
                "description": "On all platforms, if Live Preview is disconnected, Brackets will show a notification. On Windows, launching and finding Chrome is now more reliable."
            },
            {
                "name": "JavaScript Code Intelligence Improvements",
                "description": "JavaScript Quick Edit now uses the Tern-based code intelligence engine for finding function definitions. Also, bug fixes and performance optimizations were made in JavaScript code hinting."
            },
            {
                "name": "Typing Performance",
                "description": "A substantial typing performance regression has been fixed."
            }
        ]
    },
    {
        "buildNumber": 7204,
        "versionString": "Sprint 24",
        "dateString": "04-26-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-24",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "New Quick View",
                "description": "Use your mouse to hover over color, gradient and image values for an in-editor preview."
            },
            {
                "name": "New Quick Docs for CSS",
                "description": "Press Ctrl+K or ⌘K on a CSS property to view community generated documentation powered by WebPlatform.org."
            },
            {
                "name": "Advanced JavaScript Code Intelligence",
                "description": "New JavaScript code intelligence based on the Tern project. Increased code hinting accuracy, camelCase support and built-in intelligence for RequireJS and jQuery."
            },
            {
                "name": "Jump To Definition",
                "description": "Instantly locate a function or property definition in your project by pressing Ctrl+J or ⌘J."
            },
            {
                "name": "Function Argument / Signature Hints",
                "description": "Press Ctrl+Space inside a function call's ()s to see information on its arguments and their types."
            },
            {
                "name": "New Project Panel Design",
                "description": "Visual updates to the project panel."
            },
            {
                "name": "Install Extensions From Toolbar",
                "description": "Install extensions directly from the toolbar."
            }
        ]
    },
    {
        "buildNumber": 6726,
        "versionString": "Sprint 23",
        "dateString": "04-10-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-23",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "HTML Highlight w/ Live Preview",
                "description": "When in Live Preview mode, place the cursor on an HTML element to highlight that element in the browser. Highlighting can be toggled on/off with Ctrl+Shift+C or ⇧⌘C. Support is currently limited to files with saved changes."
            },
            {
                "name": "New Toolbar",
                "description": "A new toolbar is now docked on the right in Brackets. This replaces the top title bar and HTML menus. Icons for Live Preview and other extensions will be found here."
            },
            {
                "name": "New Polish Support and Language Updates",
                "description": "A new Polish translation has been created for Brackets. French, German, Czech and Chinese translations have been updated."
            }
        ]
    },
    {
        "buildNumber": 6428,
        "versionString": "Sprint 22",
        "dateString": "03-22-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-22",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Easier Extension Installation",
                "description": "Install extensions in the Brackets UI via File > Install Extensions…. A URL to a ZIP file or GitHub repo is required."
            },
            {
                "name": "Word Wrap",
                "description": "Word wrap is now enabled by default. Use the View > Enable Word Wrap menu to toggle."
            },
            {
                "name": "Show Active Line",
                "description": "Active line highlighting emphasizes which line the cursor is positioned on. Use the View > Show Active Line menu to toggle."
            },
            {
                "name": "Hide Line Numbers",
                "description": "Line numbers can now be hidden. Use the View > Show Line Numbers menu to toggle."
            },
            {
                "name": "Live Development Reliability",
                "description": "Improvements and bug fixes were made to make the connection to Chrome more reliable and to report errors more effectively."
            },
            {
                "name": "New/Updated Translations",
                "description": "New Chinese translation was added. Also, French, Japanese, German and Italian translations have been updated."
            }
        ]
    },
    {
        "buildNumber": 5990,
        "versionString": "Sprint 21",
        "dateString": "03-01-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-21",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "JavaScript Code Hinting",
                "description": "New code hinting for JavaScript includes keywords, local variables, arguments, and property names."
            },
            {
                "name": "Default Live Development on Localhost (w/ Node.js)",
                "description": "By default, Live Development uses a built-in webserver powered by node.js."
            },
            {
                "name": "Drag to Dock to Open Files (OSX)",
                "description": "Drag a file directly to the Brackets dock icon to open."
            },
            {
                "name": "Drag and Drop to Open Files (Windows)",
                "description": "Drag a file directly into Brackets to open."
            },
            {
                "name": "Remember Cursor & Scroll Position",
                "description": "Files left open after close will retain cursor and scroll position on launch. During a session, cursor and scroll position is retained for closed files upon reopening."
            }
        ]
    },
    {
        "buildNumber": 5672,
        "versionString": "Sprint 20",
        "dateString": "02-14-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-20",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Upgrade to CodeMirror 3",
                "description": "The core code editor has been updated to CodeMirror 3, fixing many issues and enabling new functionality."
            },
            {
                "name": "Improved Undo/Redo",
                "description": "Undo restores the old selection and cursor position."
            },
            {
                "name": "Line Numbers Always Visible",
                "description": "Gutter line numbers stay in view when scrolling horizontally."
            },
            {
                "name": "Double/Triple Click and Drag",
                "description": "Double-click-drag and triple-click-drag to select multiple words/lines quickly."
            },
            {
                "name": "Search Improvements",
                "description": "All Find results are highlighted when search bar is open. Current result is centered in the editor."
            }
        ]
    },
    {
        "buildNumber": 5290,
        "versionString": "Sprint 19",
        "dateString": "01-18-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-19",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Native Menu Bar",
                "description": "Menus now appear in the Mac/Windows native menus."
            },
            {
                "name": "CSS Code Hints",
                "description": "Code hinting for CSS properties and values now appear for CSS files and <style> blocks."
            },
            {
                "name": "Quick Open and Go to Definition Improvements",
                "description": "Result rankings and query response times are improved."
            },
            {
                "name": "Mac Keyboard Shortcut Changes",
                "description": "Toggle Block Comment now uses ⌘⌥/. ⌘←, previously used as a Home shortcut, now acts as a Smart Home shortcut. Smart home moves the cursor to the first non-whitespace character on the line."
            },
            {
                "name": "New/Updated Translations",
                "description": "New Swedish and Portuguese translations were added. Also, French, Russian, Spanish and Turkish translations have been updated."
            }
        ]
    },
    {
        "buildNumber": 5070,
        "versionString": "Sprint 18",
        "dateString": "12-20-2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-18",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "CSS/HTML Toggle Comment Improvements",
                "description": "Fixed several issues when handling Toggle Line/Block Comment in CSS and HTML files."
            },
            {
                "name": "HTML Attribute Filtering in Code Hints",
                "description": "When showing attribute code hints, the existing attributes on the tag are filtered."
            },
            {
                "name": "Rename File in Working Set",
                "description": "Clicking on the active file in the working set triggers a file rename."
            },
            {
                "name": "New/Updated Translations",
                "description": "A new Russian translation was contributed this sprint. Also, German and Spanish translations have been updated."
            }
        ]
    },
    {
        "buildNumber": 4728,
        "versionString": "Sprint 17",
        "dateString": "11-30-2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-17",
        "downloadURL": "https://github.com/adobe/brackets/downloads",
        "newFeatures": [
            {
                "name": "Inline Color Picker",
                "description": "When the cursor is on a hex, rgb() or hsl() color, you can use Ctrl-E or ⌘E to edit the color inline."
            },
            {
                "name": "CSS Highlighting in Live Preview",
                "description": "While Live Preview is active, putting the cursor in a rule in a CSS file highlights items affected by that rule in the browser."
            },
            {
                "name": "Block Comment/Uncomment",
                "description": "Use Ctrl-Shift-/ or ⌘⇧/ to toggle block comments around the current selection."
            },
            {
                "name": "Find in File or Folder",
                "description": "You can now search the contents of a specific file or folder by choosing \"Find in…\" from the context menu in the file tree."
            },
            {
                "name": "New/Updated Translations",
                "description": "A new Turkish translation for Brackets was added and the Japanese, German, Spanish, French and Italian translations were updated, all by community members."
            }
        ]
    },
    {
        "buildNumber": 4439,
        "versionString": "Sprint 16",
        "dateString": "11-06-2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-16",
        "downloadURL": "https://github.com/adobe/brackets/downloads",
        "newFeatures": [
            {
                "name": "URL Mapping for Live Preview",
                "description": "You can now use Live Preview with server-based content by specifying a base URL in Project Settings."
            },
            {
                "name": "Extensions Stored Outside of the Application Folder",
                "description": "Extensions are now stored per user. Windows: C:\\Users\\<user>\\AppData\\Roaming\\Brackets\\extensions. Mac: /Users/<user>/Library/Application Support/Brackets/extensions."
            },
            {
                "name": "Working Set Sorting and Reordering",
                "description": "Sort by name, type or time added by choosing an option from the context menu. Also, the working set may be reordered using drag and drop."
            },
            {
                "name": "New/Updated Translations",
                "description": "A new Japanese translation for Brackets was added and the German translation has been updated (both are community contributed)."
            },
            {
                "name": "Improved Quick Open",
                "description": "Quick Open now searches on the whole path (not just filename), and accepts CamelCase abbreviations and other non-contiguous matches."
            }
        ]
    },
    {
        "buildNumber": 4083,
        "versionString": "Sprint 15",
        "dateString": "10-18-2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-15",
        "downloadURL": "https://github.com/adobe/brackets/downloads",
        "newFeatures": [
            {
                "name": "Status Bar",
                "description": "Displays cursor info, file size, file type, JSLint notification, indentation preferences and busy spinner."
            },
            {
                "name": "Indentation Preferences",
                "description": "Toggle between indentation via tabs or spaces and set the indentations size from the status bar."
            },
            {
                "name": "Auto Reload in Live Preview",
                "description": "Reloads the browser when saving non-CSS files."
            },
            {
                "name": "Resizable Bottom Panels",
                "description": "Search Results and JSLint panels can now resize vertically."
            },
            {
                "name": "Incremental Find",
                "description": "Highlights the first matching result when typing in the Find dialog."
            },
            {
                "name": "Delete Line",
                "description": "Ctrl+Shift+D or ⌘⇧D to delete the current line or lines if there is a selection."
            },
            {
                "name": "Code Hints for Relative URLs",
                "description": "href and src attributes show relative paths for files on disk."
            },
            {
                "name": "New Folder",
                "description": "Create a new folder using the File > New Folder menu item or when right clicking in the project tree."
            },
            {
                "name": "Rename Files and Folders",
                "description": "Right click on a file or folder in the project tree and choose Rename."
            },
            {
                "name": "Show in File Tree",
                "description": "Navigate > Show in File Tree menu item will highlight the current file."
            },
            {
                "name": "New Translations",
                "description": "Italian and Brazilian Portuguese community contributed translations."
            }
        ]
    },
    {
        "buildNumber": 3791,
        "versionString": "Sprint 14",
        "dateString": "9-20-2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-14",
        "downloadURL": "https://github.com/adobe/brackets/downloads",
        "newFeatures": [
            {
                "name": "New Editor Font: Source Code Pro",
                "description": "Brackets now uses a new, open-source monospace font called Source Code Pro."
            },
            {
                "name": "Help Menu",
                "description": "Moved Debug menu items \"Show Extensions Folder\" and \"Check for Updates\" to a new Help menu."
            },
            {
                "name": "Improved Development Workflow",
                "description": "See the brackets-shell README."
            },
            {
                "name": "Finished French Localization",
                "description": "Both the application and installers are now localized in French."
            },
            {
                "name": "Version Info",
                "description": "Version info can be accessed via the Help > About menu."
            }
        ]
    }
]
