[
    {
        "buildNumber": 12606,
        "versionString": "Sprint 38",
        "dateString": "14-04-2014",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-38",
        "downloadURL": "http://brackets.io",
        "newFeatures": [
            {
                "name": "Curseurs et sélections multiples",
                "description": "Créez plusieurs curseurs, ainsi que des sélections non contiguës ou rectangulaires, pour effectuer les mêmes modifications à plusieurs endroits à la fois."
            },
            {
                "name": "Ajouter des occurrences à la sélection",
                "description": "Vous pouvez ajouter rapidement l’instance suivante du mot ou de l’élément actif à la sélection multiple en appuyant sur ⌘B/Ctrl+B. Pour ajouter toutes les instances, utilisez la combinaison ⌘⌃G/Alt-F3. Pratique pour renommer rapidement des éléments."
            },
            {
                "name": "Annuler la sélection",
                "description": "Vous pouvez annuler la dernière modification apportée à la sélection avec ⌘U/Ctrl+U, et rétablir la sélection précédente avec ⌘⇧U/Ctrl+Maj+U. Cette fonction permet de corriger les erreurs concernant la sélection de plusieurs éléments, ou de revenir à une sélection précédente."
            },  
            {
                "name": "Réduire tous les enfants",
                "description": "Utilisez la combinaison ⌘⌥Clic/Ctrl+Alt+Clic pour réduire tous les enfants d’un dossier dans l’arborescence des fichiers."
            },
            {
                "name": "Commentaires améliorés pour la fonction Edition rapide",
                "description": "Lorsque vous tentez d’utiliser les fonctions Edition rapide (⌘E/Ctrl+E) et Documentation rapide (⌘K/Ctrl+K) sur des éléments de code ne prenant pas en charge ces commandes, des explications s’affichent à l’écran."
            },            
            {
                "name": "Prise en charge des fichiers .ico en mode Aperçu d’image",
                "description": "Vous pouvez désormais afficher un aperçu des fichiers .ico en les sélectionnant dans l’arborescence."
            },
            {
                "name": "API d’analyse lint asynchrone",
                "description": "Les utilitaires lint peuvent maintenant lancer des analyses asynchrones, pour une réactivité et des performances optimales."
            }
        ]
    },            
    {
        "buildNumber": 12014,
        "versionString": "Sprint 37",
        "dateString": "17-03-2014",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-37",
        "downloadURL": "http://brackets.io",
        "newFeatures": [
            {
                "name": "Exclusion de fichiers/dossiers de la fonction « Rechercher dans les fichiers »",
                "description": "Indiquez les noms des fichiers ou dossiers à exclure des recherches multi-fichiers (ou utilisez des caractères génériques)."
            },
            {
                "name": "Versions signées sous Mac et Windows",
                "description": "Les versions de Brackets sont désormais associées à une signature de code sous Mac et Windows, ce qui facilite l’installation et les mises à jour."
            },
            {
                "name": "Améliorations relatives à l’interface de préférences",
                "description": "La nouvelle API Préférences est désormais compatible avec les extensions à utiliser. En outre, de nouvelles préférences ont été ajoutées. Reportez-vous à la documentation disponible sur http://is.gd/BracketsPrefs."
            },
            {
                "name": "Installation d’extensions via un proxy",
                "description": "L’utilisateur peut désormais définir la préférence « Proxy » pour que Brackets puisse installer des extensions par le biais d’un serveur de proxy. Pour plus d’informations, consultez la page http://is.gd/BracketsPrefs."
            },
            {
                "name": "Amélioration de la commande Edition rapide pour les fonctions de temporisation",
                "description": "Désormais, vous pouvez faire appel à la commande Edition rapide sur une fonction de temporisation d’animation incomplète (par exemple, « cubic-bezier() ») pour créer une courbe de Bézier en partant de zéro."
            },
            {
                "name": "Interface du mode Remplacement",
                "description": "L’aspect du curseur change lorsque l’utilisateur est en mode Remplacement, et il est possible de passer du mode Insertion au mode Remplacement depuis la barre d’état."
            },
            {
                "name": "Stabilité et performances améliorées pour le système de fichiers et le module Aperçu en direct",
                "description": "Nous avons corrigé plusieurs problèmes critiques suite auxquels les changements de fichiers externes n’étaient pas reconnus et le module Aperçu en direct ne se lançait pas correctement."
            },
            {
                "name": "Traduction en indonésien",
                "description": "Le logiciel a été traduit en indonésien."
            }
        ]
    },
    {
        "buildNumber": 11506,
        "versionString": "Sprint 36",
        "dateString": "07-02-2014",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-36",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Préférences améliorées",
                "description": "Utilisez les fichiers de configuration JSON pour définir les paramètres par dossier ou type de fichier."
            },
            {
                "name": "Amélioration de la prise en charge LESS",
                "description": "Les indicateurs de code CSS et la fonction Documentation rapide sont désormais pris en charge lors de l’édition de fichiers LESS."
            },
            {
                "name": "Système de fichiers et performances",
                "description": "Désormais, l’éditeur et l’arborescence de fichiers Projet sont automatiquement mis à jour en fonction des modifications externes. Les opérations telles que « Rechercher dans les fichiers » s’exécutent beaucoup plus rapidement."
            },
            {
                "name": "Extensions",
                "description": "La nouvelle commande Déboguer > Recharger sans les extensions permet de résoudre les problèmes rencontrés. A présent, en cas de mise à jour ou de suppression d’extensions, Brackets se recharge automatiquement, de sorte que vous n’avez plus besoin de quitter et de relancer l’application."
            },
            {
                "name": "Edition rapide pour la temporisation des animations",
                "description": "Lorsque la sélection porte sur la fonction de temporisation steps() d’une animation CSS, vous pouvez utiliser le module Edition rapide (Ctrl+E/⌘E) pour éditer visuellement les paramètres."
            },
            {
                "name": "Mises à jour de l’interface utilisateur Windows",
                "description": "De nombreux problèmes d’affichage (aspect chromé des fenêtres) ont été corrigés."
            },
            {
                "name": "Analyse lint",
                "description": "Plusieurs extensions peuvent enregistrer des utilitaires lint pour le même langage et tous les résultats seront affichés ensemble dans le panneau d’analyse lint."
            },
            {
                "name": "Nouvelles langues prises en charge",
                "description": "Brackets est maintenant disponible en grec et en coréen."
            }
        ]
    },
    {
        "buildNumber": 10897,
        "versionString": "Sprint 35",
        "dateString": "17-12-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-35",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Nouvelle interface Rechercher/Remplacer",
                "description": "L’option Remplacer s’appuie désormais sur une interface utilisateur rationalisée et beaucoup plus simple, prenant en charge les mêmes fonctionnalités que l’option Rechercher, y compris la recherche incrémentielle et le surlignage. De nouveaux boutons bascule d’expressions régulières et sensibles à la casse permettent d’accéder rapidement aux options Rechercher, Rechercher dans les fichiers et Remplacer."
            },
            {
                "name": "Lancement de l’Aperçu en direct sous Mac",
                "description": "Sous Mac, il n’est pas nécessaire de relancer Chrome lorsque vous lancez le module Aperçu en direct."
            },
            {
                "name": "Démarrage plus rapide",
                "description": "Brackets se charge désormais 50 % plus vite grâce au code JavaScript réduit et aux fichiers LESS précompilés."
            }
        ]
    },
    {
        "buildNumber": 10733,
        "versionString": "(Hotfix) Sprint 34.1",
        "dateString": "03-12-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-34.1",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Correction des problèmes de blocage à l’ouverture des fichiers JavaScript",
                "description": "Correctif n°6067 : l’ouverture de fichiers JavaScript à l’intérieur de dossiers contenant certains autres fichiers provoquait un blocage de Brackets."
            },
            {
                "name": "Correction des problèmes d’interface utilisateur liés à certains fichiers LESS",
                "description": "Correctif n°6057 : à l’ouverture de certains fichiers LESS, l’interface de l’éditeur disparaissait en partie ou présentait d’autres problèmes d’affichage."
            }            
        ]
    },  
    {
        "buildNumber": 10729,
        "versionString": "Sprint 34",
        "dateString": "15-11-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-34",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Mise à niveau d’installations Brackets existantes",
                "description": "Pour les futures versions de Brackets, à commencer par le Sprint 35, la mise à niveau de l’installation existante se fera sur place. Remarque : il est toujours possible d’installer simultanément les versions Sprint 33 et antérieures ou de les désinstaller."
            },
            {
                "name": "Amélioration de l’interface utilisateur",
                "description": "La version Mac dispose à présent d’une barre de titre foncée, plus cohérente avec le reste de l’interface Brackets."
            },
            {
                "name": "Fiabilité des indicateurs de code JavaScript",
                "description": "Nous avons résolu les problèmes pour lesquels il manquait des indicateurs de code dans les fichiers de taille moyenne (de 500 à 2 000 lignes), ainsi que dans les cas où les exportations d’un module avaient été modifiées."
            },
            {
                "name": "Traductions nouvelles et mises à jour",
                "description": "De nouvelles traductions en néerlandais, en perse et en roumain ont été ajoutées par les communautés respectives. Les traductions en français, japonais, portugais brésilien, tchèque, finnois, allemand, espagnol et suédois ont été mises à jour."
            },
            {
                "name": "Amélioration de l’API du système de fichiers",
                "description": "Les auteurs d’extensions peuvent désormais créer des extensions plus solides et plus efficaces grâce à l’API mise à jour du système de fichiers. Des informations importantes ainsi que les consignes de migration sont fournies dans les notes de mise à jour."
            }
        ]
    },
    {
        "buildNumber": 10188,
        "versionString": "Sprint 33",
        "dateString": "29-10-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-33",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Aperçu de l’image",
                "description": "Si vous sélectionnez une image dans l’arborescence de fichiers, un aperçu s’affiche."
            },
            {
                "name": "Nouvelle règle CSS pour le module Edition rapide",
                "description": "Utilisez le bouton Nouvelle règle dans le module CSS Edition rapide (Ctrl+E/⌘E) pour créer une règle spécifique à la balise/la classe/l’identifiant sélectionné, même s’il n’existe aucune autre règle. Vous pouvez modifier le sélecteur une fois l’étape de création terminée."
            },
            {
                "name": "Edition rapide pour l’accélération d’animations",
                "description": "Lorsque la sélection porte sur la fonction temporelle d’une animation CSS, vous pouvez utiliser le module Edition rapide (Ctrl+E/⌘E) pour éditer visuellement la courbe temporelle."
            },
            {
                "name": "Remplacement d’expressions régulières",
                "description": "Lorsque vous utilisez une expression régulière dans la fonction Rechercher/Remplacer, vous pouvez indiquer $1, $2, etc. dans la chaîne de remplacement pour faire référence à des sous-expressions entre parenthèses dans la chaîne de requête."
            },
            {
                "name": "Amélioration de l’interface utilisateur",
                "description": "Les widgets du module Edition rapide disposent désormais d’un bouton Fermer. Quand elle ne trouve aucun résultat, la fonction « Rechercher dans les fichiers » le signale."
            },
            {
                "name": "Traductions mises à jour",
                "description": "Les traductions en allemand, français, japonais et tchèque ont été mises à jour."
            }
        ]
    },
    {
        "buildNumber": 9791,
        "versionString": "Sprint 32",
        "dateString": "04-10-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-32",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Lancer l’Aperçu en direct pour un fichier non HTML",
                "description": "Brackets détecte automatiquement un fichier index.html à utiliser. Plus besoin de vous éloigner de votre fichier CSS pour lancer l’Aperçu en direct !"
            },
            {
                "name": "Amélioration des performances pour la fonction de recherche au cours de la frappe",
                "description": "Les performances sont améliorées dès que l’utilisateur saisit un ou deux caractères dans le champ Rechercher (et que le nombre de résultats est donc très élevé)."
            },
            {
                "name": "Mise à jour de Node vers la version 0.10",
                "description": "Il s’agit d’une évolution réalisée « sous le capot »."
            },
            {
                "name": "Amélioration de l’API d’analyse lint",
                "description": "Les créateurs d’extensions peuvent désormais utiliser le moteur d’analyse lint sans réfléchir."
            },
            {
                "name": "Traductions mises à jour",
                "description": "Les traductions en français, japonais, allemand, tchèque, portugais brésilien, suédois et turc ont été mises à jour."
            }
        ]
    },
    {
        "buildNumber": 9569,
        "versionString": "Sprint 31",
        "dateString": "20-09-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-31",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Aperçu en direct pour HTML",
                "description": "L’Aperçu en direct se met à jour en temps réel, à mesure que vous saisissez des données dans vos fichiers HTML. La mise à jour s’interrompt dès que la syntaxe du code HTML n’est pas valide."
            },
            {
                "name": "Interface utilisateur Windows",
                "description": "L’interface Windows dispose désormais d’une barre de titre de couleur foncée. La même modification sera également bientôt effective sous Mac."
            },
            {
                "name": "Prise en charge du clavier pour la liste Projets récents",
                "description": "Appuyez sur Ctrl+Alt+R (⌥⌘R) pour ouvrir la liste déroulante « Projets récents », puis servez-vous des flèches et de la touche Entrée pour passer d’un projet à l’autre."
            },
            {
                "name": "Indicateurs de code CSS dans SCSS",
                "description": "Indicateurs de code concernant les noms et valeurs de propriétés CSS : désormais, les indicateurs de code disponibles dans les fichiers CSS seront également visibles dans les fichiers SCSS. Documentation rapide pour propriétés CSS : idem, comme dans CSS."
            },
            {
                "name": "Surlignage des balises correspondantes HTML",
                "description": "Les balises d’ouverture et de fermeture correspondantes apparaissent surlignées."
            },
            {
                "name": "Recherche",
                "description": "Les résultats de la fonction « Rechercher dans les fichiers » sont mis à jour au fur et à mesure de la saisie."
            },
            {
                "name": "Repères sur les résultats de la recherche",
                "description": "Les résultats des recherches sont signalés par des repères jaunes tout le long de la barre de défilement."
            }
        ]
    },
    {
        "buildNumber": 9116,
        "versionString": "Sprint 30",
        "dateString": "29-08-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-30",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "OS X 10.6 à nouveau pris en charge",
                "description": "Brackets ne se bloque plus au lancement de l’application sous Mac OS X 10.6.x."
            },
            {
                "name": "Améliorations et correctifs pour la fonction Aperçu sous Linux",
                "description": "La suppression de fichiers, le surlignage HTML et Extension Manager sont maintenant actifs dans l’Aperçu en direct. Nous avons également corrigé différents problèmes liés à l’installation du package Debian."
            },
            {
                "name": "Indicateurs de code pour les flux nommés des régions CSS",
                "description": "Les flux nommés des régions CSS figurent désormais dans les indicateurs de code des propriétés flow-into et flow-from."
            },
            {
                "name": "Indicateurs de paramètres de fonction",
                "description": "Des indicateurs apparaissent automatiquement lorsque vous commencez à saisir du texte dans les parenthèses, et peuvent aussi être affichés manuellement via la combinaison Ctrl+Maj+Espace."
            },
            {
                "name": "Remplacer tout",
                "description": "La commande Remplacer tout affiche un panneau indiquant toutes les occurrences qui seront remplacées. Vous pouvez parcourir ces occurrences et déselectionner celles que vous souhaitez conserver telles quelles."
            },
            {
                "name": "Remarque : mise à jour de l’extension Theseus requise",
                "description": "Tous les utilisateurs de l’extension Theseus doivent procéder à une mise à jour en raison d’une rupture de compatibilité. Par ailleurs, les développeurs Brackets peuvent maintenant utiliser Theseus pour déboguer une instance de Brackets."
            },
            {
                "name": "Traductions mises à jour",
                "description": "Les traductions en allemand, français, japonais et turc ont été mises à jour."
            }
        ]
    },
    {
        "buildNumber": 8528,
        "versionString": "Sprint 28",
        "dateString": "29-07-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-28",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Remarque : impossible à exécuter sur OS X 10.6",
                "description": "N’effectuez pas la mise à niveau sous Mac OS X 10.6.x, car les Sprints 27 et 28 ne pourront pas s’exécuter. Nous avons déterminé la source du problème et espérons pouvoir y remédier avec le Sprint 29. En attendant, avec Snow Leopard, utilisez le Sprint 26 ou une version antérieure."
            },
            {
                "name": "Nouveau document sans nom",
                "description": "La commande Fichier > Nouveau permet désormais de créer un document vide sans nom en mémoire, comme dans les autres éditeurs de texte ; il vous sera demandé d’indiquer un nom de fichier au moment de son enregistrement. Vous pouvez toujours créer directement un nouveau fichier sur le disque en sélectionnant Nouveau fichier dans le menu contextuel de l’arborescence de fichiers."
            },
            {
                "name": "Installation d’extensions à partir du registre",
                "description": "Extension Manager inclut maintenant un onglet dans lequel sont répertoriées toutes les extensions disponibles pour Brackets. En un clic, vous pouvez installer une extension à partir de cette liste ou mettre à jour une extension avec la dernière version disponible. Les développeurs peuvent charger des extensions dans le registre sur brackets-registry.aboutweb.com."
            },
            {
                "name": "Glisser-déposer à partir d’OS",
                "description": "Vous pouvez désormais faire glisser des fichiers depuis OS vers la fenêtre Brackets afin de les ouvrir. Vous pouvez également faire glisser un dossier vers la fenêtre Brackets afin de l’ouvrir dans la barre latérale."
            },
            {
                "name": "Animations pour l’édition et l’affichage rapides",
                "description": "Les vues Edition rapide s’animent à l’ouverture et à la fermeture, et la fenêtre contextuelle Affichage rapide présente un léger effet d’agrandissement."
            }
        ]
    },
    {
        "buildNumber": 8254,
        "versionString": "Sprint 27",
        "dateString": "26-06-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-27",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Enregistrer sous",
                "description": "Enregistrez une copie d’un fichier en utilisant le menu Fichier > Enregistrer sous…, le menu contextuel de l’arborescence du projet ou le raccourci clavier Ctrl+Maj+S ou ⇧⌘S."
            },
            {
                "name": "Mise à jour de la fonction d’aperçu rapide pour les dégradés",
                "description": "La fonction d’aperçu rapide des dégradés prend maintenant en charge le mot-clé « to » indiquant la direction du dégradé, ainsi que les nouveaux types de dégradé repeating-linear-gradient et repeating-radial-gradient."
            },
            {
                "name": "Nouvelle version en hongrois et autres langues mises à jour",
                "description": "Brackets est maintenant disponible en hongrois. Par ailleurs, les traductions en espagnol, français et tchèque ont été mises à jour."
            },
            {
                "name": "Nouveau shell natif",
                "description": "Brackets fonctionne à présent avec une nouvelle version de Chromium Embedded Framework. Cela n’entraîne pas de changements significatifs pour l’utilisateur, mais n’hésitez pas à signaler tout problème rencontré."
            }
        ]
    },
    {
        "buildNumber": 8034,
        "versionString": "Sprint 26",
        "dateString": "10-06-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-26",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Mise à jour d’extensions installées",
                "description": "Extension Manager permet maintenant de mettre à jour une extension installée sans procéder au préalable à une désinstallation manuelle de l’extension."
            },
            {
                "name": "Nouvelle apparence de la barre d’état",
                "description": "Des améliorations visuelles ont été apportées à la barre d’état, avec notamment de nouvelles icônes pour la validation JSLint."
            },
            {
                "name": "Afficher/Masquer les erreurs JSLint",
                "description": "En cas d’erreurs JSLint, cliquez sur l’icône d’état dans la barre d’état pour afficher/masquer le panneau JSLint."
            },
            {
                "name": "Indicateurs d’URL pour CSS",
                "description": "Lorsque vous utilisez une déclaration @import ou url(), des indicateurs de code affichent les chemins relatifs des fichiers de votre projet."
            },
            {
                "name": "Boutons OK/Annuler des boîtes de dialogue sous Windows",
                "description": "Les boutons OK et Annuler des boîtes de dialogue s’affichent maintenant dans le bon ordre. Leurs positions étaient auparavant inversées."
            },
            {
                "name": "Architecture : mises à jour de jQuery, Bootstrap et LESS",
                "description": "Brackets fonctionne à présent avec des versions plus récentes de jQuery, Bootstrap et LESS. Cela n’entraîne pas de changements significatifs pour l’utilisateur, mais n’hésitez pas à signaler tout problème rencontré."
            }
        ]
    },
    {
        "buildNumber": 7701,
        "versionString": "Sprint 25",
        "dateString": "21-05-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-25",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Extension Manager",
                "description": "A partir de l’icône de la barre d’outils ou de Fichier > Extension Manager…, vous pouvez afficher, rechercher et supprimer des extensions installées. Pour installer de nouvelles extensions, utilisez le bouton Installer à partir de l’URL… dans Extension Manager."
            },
            {
                "name": "Suppression de fichiers/dossiers",
                "description": "Les fichiers et dossiers peuvent être supprimés de l’arborescence des fichiers via le menu contextuel ou Fichier > Supprimer."
            },
            {
                "name": "Affichage dans le SE",
                "description": "Effectuez un clic droit sur un fichier ou un dossier et choisissez l’option Afficher dans le SE pour ouvrir l’emplacement dans Mac Finder ou l’Explorateur Windows."
            },
            {
                "name": "Actualisation de l’arborescence des fichiers",
                "description": "Effectuez un clic droit sur l’arborescence des fichiers et sélectionnez Actualiser pour mettre à jour la liste de fichiers à partir du disque."
            },
            {
                "name": "Fiabilité de l’Aperçu en direct",
                "description": "Sur toutes les plates-formes, Brackets affiche une notification lorsque le module Aperçu en direct est déconnecté. Sous Windows, vous pouvez maintenant lancer et accéder à Chrome de façon plus fiable."
            },
            {
                "name": "Amélioration des indicateurs de code JavaScript",
                "description": "L’édition rapide JavaScript Quick utilise maintenant un moteur d’indications de code intelligent basé sur Tern pour accéder aux définitions des fonctions. Par ailleurs, des correctifs et des améliorations en termes de performances ont été apportées aux indicateurs de code JavaScript."
            },
            {
                "name": "Performances de saisie",
                "description": "Une importante régression en termes de performances de saisie a été résolue."
            }
        ]
    },
    {
        "buildNumber": 7204,
        "versionString": "Sprint 24",
        "dateString": "26-04-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-24",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Nouvel affichage rapide",
                "description": "Placez le curseur de la souris sur des valeurs de couleurs, dégradés ou images pour afficher un aperçu intégré à l’éditeur."
            },
            {
                "name": "Nouvelle documentation rapide pour CSS",
                "description": "Effectuez la combinaison Ctrl+K ou ⌘K sur une propriété CSS pour afficher la documentation fournie par la communauté de WebPlatform.org."
            },
            {
                "name": "Indicateurs de code JavaScript avancés",
                "description": "Nouveaux indicateurs de code JavaScript basés sur le projet Tern. Indications de code plus précises, prise en charge de camelCase et informations intégrées sur RequireJS et jQuery."
            },
            {
                "name": "Accès à la définition",
                "description": "Localisez instantanément une définition de fonction ou de propriété dans votre projet avec Ctrl+J ou ⌘J."
            },
            {
                "name": "Arguments des fonctions / Indicateurs de signature",
                "description": "Utilisez Ctrl+Espace dans un appel de fonction ()s pour afficher des informations sur ses arguments et leurs types."
            },
            {
                "name": "Nouveau visuel du panneau de projet",
                "description": "Améliorations visuelles apportées au panneau de projet."
            },
            {
                "name": "Installation d’extensions à partir de la barre d’outils",
                "description": "Installez directement des extensions depuis la barre d’outils."
            }
        ]
    },
    {
        "buildNumber": 6726,
        "versionString": "Sprint 23",
        "dateString": "10-04-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-23",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Surlignement HTML avec l'Aperçu en direct",
                "description": "En mode Aperçu en direct, placez le curseur sur un élément HTML pour le surligner dans le navigateur. Vous pouvez activer/désactiver le surlignement en appuyant sur Ctrl+Maj+C ou ⇧⌘C. Cette fonctionnalité est actuellement disponible uniquement pour les fichiers dont les modifications ont été enregistrées."
            },
            {
                "name": "Nouvelle barre d'outils",
                "description": "Une nouvelle barre d'outils a été créée dans Brackets sur le côté droit. Elle remplace la barre de titre et les menus HTML supérieurs. Vous y trouverez les icônes du module Aperçu en direct et des autres extensions."
            },
            {
                "name": "Nouvelle version en polonais et autres langues mises à jour",
                "description": "Brackets est maintenant disponible en polonais. Les traductions en allemand, chinois, français et tchèque ont été mises à jour."
            }
        ]
    },
    {
        "buildNumber": 6428,
        "versionString": "Sprint 22",
        "dateString": "22-03-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-22",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Installation plus facile des extensions",
                "description": "Installez les extensions dans l’interface utilisateur de Brackets en sélectionnant Fichier > Installer les extensions…. Vous devez obligatoirement indiquer l’URL d’un fichier ZIP ou d’un référentiel GitHub."
            },
            {
                "name": "Renvoi à la ligne",
                "description": "Le renvoi à la ligne est désormais activé par défaut. Pour activer/désactiver cette fonction, sélectionnez le menu Affichage > Activer le retour à la ligne."
            },
            {
                "name": "Afficher la ligne active",
                "description": "Le surlignage de la ligne active met en évidence la ligne sur laquelle le curseur est positionné. Pour activer/désactiver cette fonction, sélectionnez le menu Affichage > Afficher la ligne active."
            },
            {
                "name": "Masquer les numéros de ligne",
                "description": "Vous pouvez désormais masquer les numéros de ligne. Pour activer/désactiver cette fonction, sélectionnez le menu Affichage > Afficher les numéros de ligne."
            },
            {
                "name": "Fiabilité de la connexion Live Development",
                "description": "Des améliorations et des correctifs ont été appliqués afin que la connexion avec Chrome soit plus fiable et que les rapports d’erreurs soient générés plus efficacement."
            },
            {
                "name": "Traductions nouvelles/mises à jour",
                "description": "Il existe désormais une nouvelle traduction en chinois. Par ailleurs, les traductions en allemand, espagnol, français, italien et japonais ont été mises à jour."
            }
        ]
    },
    {
        "buildNumber": 5990,
        "versionString": "Sprint 21",
        "dateString": "01-03-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-21",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Indicateurs de code JavaScript :",
                "description": "Les nouveaux indicateurs de code JavaScript comprennent des mots-clés, des variables locales, des arguments et des noms de propriétés."
            },
            {
                "name": "Live Development par défaut sur Localhost (avec Node.js)",
                "description": "Live Development utilise par défaut un serveur Web intégré avec node.js."
            },
            {
                "name": "Ouverture d’un fichier par glissement sur le Dock (OSX)",
                "description": "Pour ouvrir un fichier, faites-le directement glisser sur l’icône Brackets dans le dock."
            },
            {
                "name": "Ouverture de fichier par glisser-déposer (Windows)",
                "description": "Pour ouvrir un fichier, faites-le directement glisser dans Brackets."
            },
            {
                "name": "Mémorisation de la position du curseur et de la position de défilement",
                "description": "Les fichiers restés ouverts à la fermeture conservent la position du curseur et la position de défilement au démarrage. Au cours d’une même session, la position du curseur et la position de défilement sont restaurées à chaque réouverture de fichiers fermés."
            }
        ]
    },
    {
        "buildNumber": 5672,
        "versionString": "Sprint 20",
        "dateString": "14-02-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-20",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Mise à niveau vers CodeMirror 3",
                "description": "L’éditeur de code principal a été mis à jour vers CodeMirror 3, ce qui a résolu plusieurs problèmes et permis l’ajout de nouvelles fonctionnalités."
            },
            {
                "name": "Amélioration des fonctions Annuler/Répéter",
                "description": "La fonction Annuler restaure la sélection précédente et rétablit la position du curseur."
            },
            {
                "name": "Numéros de lignes toujours visibles",
                "description": "Les numéros de ligne de la gouttière restent visibles en cas de défilement horizontal."
            },
            {
                "name": "Double/triple-cliquer et glisser",
                "description": "Double-cliquez ou triple-cliquez en faisant glisser le curseur pour sélectionner rapidement plusieurs mots/lignes."
            },
            {
                "name": "Amélioration des fonctions de recherche",
                "description": "Lorsque la barre de recherche est ouverte, tous les résultats sont mis en surbrillance. Le résultat actuel apparaît au centre de l’éditeur."
            }
        ]
    },
    {
        "buildNumber": 5290,
        "versionString": "Sprint 19",
        "dateString": "18-01-2013",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-19",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Barre de menu natif",
                "description": "Les menus apparaissent désormais dans les menus natifs Mac/Windows."
            },
            {
                "name": "Indicateurs de code CSS",
                "description": "Les indicateurs de code des propriétés et valeurs CSS sont maintenant disponibles pour les fichiers CSS et les blocs <style>."
            },
            {
                "name": "Amélioration des commandes Ouverture rapide et Atteindre la définition",
                "description": "Le classement des résultats et les temps de réponse des requêtes ont été améliorés."
            },
            {
                "name": "Modification des raccourcis clavier sous Mac",
                "description": "Le raccourci permettant de Commenter les blocs/Annuler les commentaires est maintenant ⌘⌥/. ⌘←, qui renvoyait auparavant vers l’accueil, fonctionne maintenant comme un raccourci d’accueil intelligent. Il déplace le curseur jusqu’au premier caractère (hors espace) de la ligne."
            },
            {
                "name": "Traductions nouvelles/mises à jour",
                "description": "De nouvelles traductions en suédois et en portugais ont été ajoutées. Les traductions en français, russe, espagnol et turc ont été mises à jour."
            }
        ]
    },
    {
        "buildNumber": 5070,
        "versionString": "Sprint 18",
        "dateString": "20-12-2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-18",
        "downloadURL": "http://download.brackets.io",
        "newFeatures": [
            {
                "name": "Amélioration de la fonction d’activation/désactivation des commentaires CSS/HTML",
                "description": "Plusieurs problèmes ont été résolus concernant le traitement de la fonction d’activation/désactivation des commentaires sur les lignes ou les blocs dans les fichiers CSS et HTML."
            },
            {
                "name": "Filtrage des attributs HTML dans les indicateurs de code",
                "description": "Lorsque vous affichez les indicateurs de code associés à des attributs, les attributs existants de la balise sont filtrés.."
            },
            {
                "name": "Renommer un fichier dans l’ensemble de documents de travail",
                "description": "En cliquant sur le fichier actif dans l’ensemble de documents de travail, vous avez désormais la possibilité de le renommer."
            },
            {
                "name": "Nouvelles traductions et mises à jour",
                "description": "Une nouvelle traduction en russe a été ajoutée à cette version. Par ailleurs, les traductions en allemand et en espagnol ont été mises à jour."
            }
        ]
    },
    {
        "buildNumber": 4728,
        "versionString": "Sprint 17",
        "dateString": "30-11-2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-17",
        "downloadURL": "https://github.com/adobe/brackets/downloads",
        "newFeatures": [
            {
                "name": "Sélecteur de couleurs en ligne",
                "description": "Lorsque vous placez le curseur sur une couleur hexadécimal, rgb() ou hsl(), vous pouvez utiliser les touches Ctrl+E ou ⌘E pour modifier cette couleur en ligne."
            },
            {
                "name": "Surlignage CSS dans l’Aperçu en direct",
                "description": "Lorsque le module Aperçu en direct est activé, si vous placez le curseur sur une règle dans un fichier CSS, les éléments concernés par cette règle apparaissent surlignés dans le navigateur."
            },
            {
                "name": "Commenter les blocs/Annuler les commentaires",
                "description": "Utilisez la combinaison Ctrl+Maj+/ ou ⌘⇧/ pour activer ou désactiver les commentaires relatifs aux blocs autour de la sélection active."
            },
            {
                "name": "Rechercher dans un fichier ou un dossier",
                "description": "Vous pouvez désormais lancer une recherche portant sur le contenu d’un fichier ou d’un dossier en cliquant sur \"Rechercher dans…\" dans le menu contextuel de l’arborescence de fichiers."
            },
            {
                "name": "Nouvelles traductions et mises à jour",
                "description": "Une nouvelle traduction de Brackets en turc a été ajoutée, tandis que les traductions en japonais, allemand, espagnol, français et italien ont été mises à jour (dans les deux cas, grâce aux contributions de la communauté d’utilisateurs)."
            }
        ]
    },
    {
        "buildNumber": 4439,
        "versionString": "Sprint 16",
        "dateString": "06-11-2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-16",
        "downloadURL": "https://github.com/adobe/brackets/downloads",
        "newFeatures": [
            {
                "name": "Mappage d’URL pour l’Aperçu en direct",
                "description": "Vous pouvez désormais utiliser l’Aperçu en direct avec le contenu du serveur en spécifiant une URL de base dans les paramètres du projet."
            },
            {
                "name": "Extensions stockées en dehors du dossier d’application",
                "description": "Les extensions sont désormais stockées par utilisateur. Windows : C:\\Utilisateurs\\<utilisateur>\\AppData\\Roaming\\Brackets\\extensions. Mac : /Users/<utilisateur>/Library/Application Support/Brackets/extensions."
            },
            {
                "name": "Tri et réorganisation de l’ensemble de documents de travail",
                "description": "Triez vos documents par nom, type ou heure d’ajout en choisissant l’option souhaitée dans le menu contextuel. Vous pouvez également réorganiser votre ensemble de documents à l’aide d’opérations de glisser-déposer."
            },
            {
                "name": "Nouvelles traductions et mises à jour",
                "description": "Une nouvelle traduction de Brackets en japonais a été ajoutée, tandis que la traduction en allemand a été mise à jour (dans les deux cas, grâce aux contributions de la communauté d’utilisateurs)."
            },
            {
                "name": "Fonction d’ouverture rapide améliorée",
                "description": "Désormais, la fonction Ouverture rapide fait porter la recherche sur le chemin d’accès complet (et non simplement sur le nom de fichier) ; elle accepte également les abréviations CamelCase et les résultats non contigus."
            }
        ]
    },
    {
        "buildNumber": 4083,
        "versionString": "Sprint 15",
        "dateString": "18-10-2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-15",
        "downloadURL": "https://github.com/adobe/brackets/downloads",
        "newFeatures": [
            {
                "name": "Barre d’état",
                "description": "Affiche les informations du curseur, la taille du fichier, le type de fichier, la notification JSLint, les préférences de mise en retrait et l’indicateur de chargement."
            },
            {
                "name": "Préférences de mise en retrait",
                "description": "Choisissez entre le retrait par tabulation ou par espace, et définissez la taille du retrait par rapport à la barre d’état."
            },
            {
                "name": "Rechargement automatique dans l’Aperçu en direct",
                "description": "Permet de recharger le navigateur lorsque vous enregistrez des fichiers non CSS."
            },
            {
                "name": "Panneaux inférieurs redimensionnables",
                "description": "Les panneaux de résultats de recherche et JSLint peuvent désormais être redimensionnés verticalement."
            },
            {
                "name": "Recherche incrémentielle",
                "description": "Met en évidence le premier résultat trouvé dès que vous saisissez du texte dans la boîte de dialogue Rechercher."
            },
            {
                "name": "Supprimer la ligne",
                "description": "Utilisez la combinaison Ctrl+Maj+D ou ⌘⇧D pour supprimer la ou les lignes actives en cas de sélection."
            },
            {
                "name": "Indicateurs de code pour adresses URL relatives",
                "description": "Les attributs href et src indiquent les chemins d’accès relatifs des fichiers sur le disque."
            },
            {
                "name": "Nouveau dossier",
                "description": "Pour créer un dossier, cliquez sur l’option de menu Fichier > Nouveau dossier, ou cliquez avec le bouton droit dans l’arborescence du projet."
            },
            {
                "name": "Renommer des fichiers et des dossiers",
                "description": "Dans l’arborescence du projet, cliquez avec le bouton droit sur un fichier ou un dossier, puis sélectionnez Renommer."
            },
            {
                "name": "Afficher dans l’arborescence de fichiers",
                "description": "Cliquez sur Naviguer > Afficher dans l’arborescence de fichiers pour mettre en évidence le fichier en cours."
            },
            {
                "name": "Nouvelles traductions",
                "description": "Des traductions en italien et en portugais brésilien sont désormais disponibles grâce aux contributions de la communauté d’utilisateurs."
            }
        ]
    },
    {
        "buildNumber": 3791,
        "versionString": "Sprint 14",
        "dateString": "20-9-2012",
        "releaseNotesURL": "https://github.com/adobe/brackets/wiki/Release-Notes:-Sprint-14",
        "downloadURL": "https://github.com/adobe/brackets/downloads",
        "newFeatures": [
            {
                "name": "Nouvelle police de l’Editeur : Source Code Pro",
                "description": "Brackets utilise désormais une nouvelle police monospace gratuite, appelée Source Code Pro."
            },
            {
                "name": "Menu Aide",
                "description": "Eléments du menu de débogage \"Afficher le dossier d’extensions\" et \"Rechercher les mises à jour\" déplacés vers un nouveau menu Aide."
            },
            {
                "name": "Flux de travaux de développement amélioré",
                "description": "Consultez le fichier README brackets-shell."
            },
            {
                "name": "Localisation en français terminée",
                "description": "L’application et le programme d’installation existent désormais en français."
            },
            {
                "name": "Informations de version",
                "description": "Les informations de version sont accessibles via le menu Aide > A propos."
            }
        ]
    }
]
